/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        unsafe { ::core::slice::from_raw_parts_mut(self.as_mut_ptr(), len) }
    }
}
impl<T> ::core::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub type __int64_t = ::core::ffi::c_longlong;
pub type __darwin_time_t = ::core::ffi::c_long;
pub type __darwin_off_t = __int64_t;
pub type time_t = __darwin_time_t;
pub const GB_model_t_GB_MODEL_DMG_B: GB_model_t = 2;
pub const GB_model_t_GB_MODEL_SGB: GB_model_t = 4;
pub const GB_model_t_GB_MODEL_SGB_NTSC: GB_model_t = 4;
pub const GB_model_t_GB_MODEL_SGB_PAL: GB_model_t = 68;
pub const GB_model_t_GB_MODEL_SGB_NTSC_NO_SFC: GB_model_t = 132;
pub const GB_model_t_GB_MODEL_SGB_NO_SFC: GB_model_t = 132;
pub const GB_model_t_GB_MODEL_SGB_PAL_NO_SFC: GB_model_t = 196;
pub const GB_model_t_GB_MODEL_MGB: GB_model_t = 256;
pub const GB_model_t_GB_MODEL_SGB2: GB_model_t = 257;
pub const GB_model_t_GB_MODEL_SGB2_NO_SFC: GB_model_t = 385;
pub const GB_model_t_GB_MODEL_CGB_0: GB_model_t = 512;
pub const GB_model_t_GB_MODEL_CGB_A: GB_model_t = 513;
pub const GB_model_t_GB_MODEL_CGB_B: GB_model_t = 514;
pub const GB_model_t_GB_MODEL_CGB_C: GB_model_t = 515;
pub const GB_model_t_GB_MODEL_CGB_D: GB_model_t = 516;
pub const GB_model_t_GB_MODEL_CGB_E: GB_model_t = 517;
pub const GB_model_t_GB_MODEL_AGB_A: GB_model_t = 519;
pub const GB_model_t_GB_MODEL_GBP_A: GB_model_t = 551;
pub const GB_model_t_GB_MODEL_AGB: GB_model_t = 519;
pub const GB_model_t_GB_MODEL_GBP: GB_model_t = 551;
pub type GB_model_t = ::core::ffi::c_uint;
pub type GB_gameboy_t = GB_gameboy_s;
unsafe extern "C" {
    pub fn GB_save_state(
        gb: *mut GB_gameboy_t,
        path: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GB_get_save_state_size(gb: *mut GB_gameboy_t) -> usize;
}
unsafe extern "C" {
    pub fn GB_save_state_to_buffer(gb: *mut GB_gameboy_t, buffer: *mut u8);
}
unsafe extern "C" {
    pub fn GB_load_state(
        gb: *mut GB_gameboy_t,
        path: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GB_load_state_from_buffer(
        gb: *mut GB_gameboy_t,
        buffer: *const u8,
        length: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GB_is_save_state(path: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn GB_get_state_model(
        path: *const ::core::ffi::c_char,
        model: *mut GB_model_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GB_get_state_model_from_buffer(
        buffer: *const u8,
        length: usize,
        model: *mut GB_model_t,
    ) -> ::core::ffi::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::core::ffi::c_uchar,
    pub _size: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::core::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::core::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::core::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::core::mem::offset_of!(__sbuf, _size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::core::ffi::c_uchar,
    pub _r: ::core::ffi::c_int,
    pub _w: ::core::ffi::c_int,
    pub _flags: ::core::ffi::c_short,
    pub _file: ::core::ffi::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::core::ffi::c_int,
    pub _cookie: *mut ::core::ffi::c_void,
    pub _close: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
    pub _read: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: *mut ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _seek: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: fpos_t,
            arg3: ::core::ffi::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::core::ffi::c_int,
    pub _ubuf: [::core::ffi::c_uchar; 3usize],
    pub _nbuf: [::core::ffi::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::core::ffi::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::core::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::core::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::core::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::core::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::core::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::core::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::core::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::core::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::core::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::core::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::core::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::core::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::core::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::core::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::core::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::core::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::core::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::core::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::core::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::core::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::core::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::core::mem::offset_of!(__sFILE, _offset) - 144usize];
};
pub type FILE = __sFILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_sample_t {
    pub left: i16,
    pub right: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_sample_t"][::core::mem::size_of::<GB_sample_t>() - 4usize];
    ["Alignment of GB_sample_t"][::core::mem::align_of::<GB_sample_t>() - 2usize];
    ["Offset of field: GB_sample_t::left"][::core::mem::offset_of!(GB_sample_t, left) - 0usize];
    ["Offset of field: GB_sample_t::right"][::core::mem::offset_of!(GB_sample_t, right) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_double_sample_t {
    pub left: f64,
    pub right: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_double_sample_t"][::core::mem::size_of::<GB_double_sample_t>() - 16usize];
    ["Alignment of GB_double_sample_t"][::core::mem::align_of::<GB_double_sample_t>() - 8usize];
    ["Offset of field: GB_double_sample_t::left"]
        [::core::mem::offset_of!(GB_double_sample_t, left) - 0usize];
    ["Offset of field: GB_double_sample_t::right"]
        [::core::mem::offset_of!(GB_double_sample_t, right) - 8usize];
};
pub const GB_channel_t_GB_SQUARE_1: GB_channel_t = 0;
pub const GB_channel_t_GB_SQUARE_2: GB_channel_t = 1;
pub const GB_channel_t_GB_WAVE: GB_channel_t = 2;
pub const GB_channel_t_GB_NOISE: GB_channel_t = 3;
pub const GB_channel_t_GB_N_CHANNELS: GB_channel_t = 4;
pub type GB_channel_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_envelope_clock_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_envelope_clock_t"][::core::mem::size_of::<GB_envelope_clock_t>() - 1usize];
    ["Alignment of GB_envelope_clock_t"][::core::mem::align_of::<GB_envelope_clock_t>() - 1usize];
};
impl GB_envelope_clock_t {
    #[inline]
    pub fn locked(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_locked(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn locked_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_locked_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn clock(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_clock(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn clock_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_clock_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn should_lock(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_should_lock(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn should_lock_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_should_lock_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn padding(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_padding(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn padding_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                5u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_padding_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        locked: bool,
        clock: bool,
        should_lock: bool,
        padding: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let locked: u8 = unsafe { ::core::mem::transmute(locked) };
            locked as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let clock: u8 = unsafe { ::core::mem::transmute(clock) };
            clock as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let should_lock: u8 = unsafe { ::core::mem::transmute(should_lock) };
            should_lock as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let padding: u8 = unsafe { ::core::mem::transmute(padding) };
            padding as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type GB_sample_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, sample: *mut GB_sample_t)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_apu_t {
    pub global_enable: bool,
    pub apu_cycles: u16,
    pub samples: [u8; 4usize],
    pub is_active: [bool; 4usize],
    pub div_divider: u8,
    pub lf_div: u8,
    pub square_sweep_countdown: u8,
    pub square_sweep_calculate_countdown: u8,
    pub square_sweep_calculate_countdown_reload_timer: u8,
    pub sweep_length_addend: u16,
    pub shadow_sweep_sample_length: u16,
    pub unshifted_sweep: bool,
    pub square_sweep_instant_calculation_done: bool,
    pub channel_1_restart_hold: u8,
    pub channel1_completed_addend: u16,
    pub square_channels: [GB_apu_t__bindgen_ty_1; 2usize],
    pub wave_channel: GB_apu_t__bindgen_ty_2,
    pub noise_channel: GB_apu_t__bindgen_ty_3,
    pub skip_div_event: GB_apu_t__bindgen_ty_4,
    pub pcm_mask: [u8; 2usize],
    pub apu_cycles_in_2mhz: bool,
    pub pending_envelope_tick: bool,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_apu_t__bindgen_ty_1 {
    pub pulse_length: u16,
    pub current_volume: u8,
    pub volume_countdown: u8,
    pub current_sample_index: u8,
    pub sample_surpressed: bool,
    pub sample_countdown: u16,
    pub sample_length: u16,
    pub length_enabled: bool,
    pub envelope_clock: GB_envelope_clock_t,
    pub delay: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_apu_t__bindgen_ty_1"][::core::mem::size_of::<GB_apu_t__bindgen_ty_1>() - 14usize];
    ["Alignment of GB_apu_t__bindgen_ty_1"]
        [::core::mem::align_of::<GB_apu_t__bindgen_ty_1>() - 2usize];
    ["Offset of field: GB_apu_t__bindgen_ty_1::pulse_length"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_1, pulse_length) - 0usize];
    ["Offset of field: GB_apu_t__bindgen_ty_1::current_volume"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_1, current_volume) - 2usize];
    ["Offset of field: GB_apu_t__bindgen_ty_1::volume_countdown"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_1, volume_countdown) - 3usize];
    ["Offset of field: GB_apu_t__bindgen_ty_1::current_sample_index"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_1, current_sample_index) - 4usize];
    ["Offset of field: GB_apu_t__bindgen_ty_1::sample_surpressed"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_1, sample_surpressed) - 5usize];
    ["Offset of field: GB_apu_t__bindgen_ty_1::sample_countdown"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_1, sample_countdown) - 6usize];
    ["Offset of field: GB_apu_t__bindgen_ty_1::sample_length"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_1, sample_length) - 8usize];
    ["Offset of field: GB_apu_t__bindgen_ty_1::length_enabled"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_1, length_enabled) - 10usize];
    ["Offset of field: GB_apu_t__bindgen_ty_1::envelope_clock"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_1, envelope_clock) - 11usize];
    ["Offset of field: GB_apu_t__bindgen_ty_1::delay"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_1, delay) - 12usize];
};
impl GB_apu_t__bindgen_ty_1 {
    #[inline]
    pub fn did_tick(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_did_tick(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn did_tick_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_did_tick_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn just_reloaded(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_just_reloaded(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn just_reloaded_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_just_reloaded_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn padding(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_padding(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn padding_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                6u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_padding_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                6u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        did_tick: bool,
        just_reloaded: bool,
        padding: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let did_tick: u8 = unsafe { ::core::mem::transmute(did_tick) };
            did_tick as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let just_reloaded: u8 = unsafe { ::core::mem::transmute(just_reloaded) };
            just_reloaded as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let padding: u8 = unsafe { ::core::mem::transmute(padding) };
            padding as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_apu_t__bindgen_ty_2 {
    pub enable: bool,
    pub pulse_length: u16,
    pub shift: u8,
    pub sample_length: u16,
    pub length_enabled: bool,
    pub sample_countdown: u16,
    pub current_sample_index: u8,
    pub current_sample_byte: u8,
    pub wave_form_just_read: bool,
    pub pulsed: bool,
    pub bugged_read_countdown: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_apu_t__bindgen_ty_2"][::core::mem::size_of::<GB_apu_t__bindgen_ty_2>() - 18usize];
    ["Alignment of GB_apu_t__bindgen_ty_2"]
        [::core::mem::align_of::<GB_apu_t__bindgen_ty_2>() - 2usize];
    ["Offset of field: GB_apu_t__bindgen_ty_2::enable"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_2, enable) - 0usize];
    ["Offset of field: GB_apu_t__bindgen_ty_2::pulse_length"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_2, pulse_length) - 2usize];
    ["Offset of field: GB_apu_t__bindgen_ty_2::shift"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_2, shift) - 4usize];
    ["Offset of field: GB_apu_t__bindgen_ty_2::sample_length"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_2, sample_length) - 6usize];
    ["Offset of field: GB_apu_t__bindgen_ty_2::length_enabled"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_2, length_enabled) - 8usize];
    ["Offset of field: GB_apu_t__bindgen_ty_2::sample_countdown"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_2, sample_countdown) - 10usize];
    ["Offset of field: GB_apu_t__bindgen_ty_2::current_sample_index"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_2, current_sample_index) - 12usize];
    ["Offset of field: GB_apu_t__bindgen_ty_2::current_sample_byte"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_2, current_sample_byte) - 13usize];
    ["Offset of field: GB_apu_t__bindgen_ty_2::wave_form_just_read"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_2, wave_form_just_read) - 14usize];
    ["Offset of field: GB_apu_t__bindgen_ty_2::pulsed"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_2, pulsed) - 15usize];
    ["Offset of field: GB_apu_t__bindgen_ty_2::bugged_read_countdown"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_2, bugged_read_countdown) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_apu_t__bindgen_ty_3 {
    pub pulse_length: u16,
    pub current_volume: u8,
    pub volume_countdown: u8,
    pub lfsr: u16,
    pub narrow: bool,
    pub counter_countdown: u8,
    pub counter: u16,
    pub length_enabled: bool,
    pub alignment: u8,
    pub current_lfsr_sample: bool,
    pub delta: i8,
    pub countdown_reloaded: bool,
    pub dmg_delayed_start: u8,
    pub envelope_clock: GB_envelope_clock_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_apu_t__bindgen_ty_3"][::core::mem::size_of::<GB_apu_t__bindgen_ty_3>() - 18usize];
    ["Alignment of GB_apu_t__bindgen_ty_3"]
        [::core::mem::align_of::<GB_apu_t__bindgen_ty_3>() - 2usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::pulse_length"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, pulse_length) - 0usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::current_volume"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, current_volume) - 2usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::volume_countdown"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, volume_countdown) - 3usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::lfsr"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, lfsr) - 4usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::narrow"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, narrow) - 6usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::counter_countdown"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, counter_countdown) - 7usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::counter"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, counter) - 8usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::length_enabled"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, length_enabled) - 10usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::alignment"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, alignment) - 11usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::current_lfsr_sample"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, current_lfsr_sample) - 12usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::delta"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, delta) - 13usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::countdown_reloaded"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, countdown_reloaded) - 14usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::dmg_delayed_start"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, dmg_delayed_start) - 15usize];
    ["Offset of field: GB_apu_t__bindgen_ty_3::envelope_clock"]
        [::core::mem::offset_of!(GB_apu_t__bindgen_ty_3, envelope_clock) - 16usize];
};
pub const GB_apu_t_GB_SKIP_DIV_EVENT_INACTIVE: GB_apu_t__bindgen_ty_4 = 0;
pub const GB_apu_t_GB_SKIP_DIV_EVENT_SKIPPED: GB_apu_t__bindgen_ty_4 = 1;
pub const GB_apu_t_GB_SKIP_DIV_EVENT_SKIP: GB_apu_t__bindgen_ty_4 = 2;
pub type GB_apu_t__bindgen_ty_4 = u8;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_apu_t"][::core::mem::size_of::<GB_apu_t>() - 98usize];
    ["Alignment of GB_apu_t"][::core::mem::align_of::<GB_apu_t>() - 2usize];
    ["Offset of field: GB_apu_t::global_enable"]
        [::core::mem::offset_of!(GB_apu_t, global_enable) - 0usize];
    ["Offset of field: GB_apu_t::apu_cycles"]
        [::core::mem::offset_of!(GB_apu_t, apu_cycles) - 2usize];
    ["Offset of field: GB_apu_t::samples"][::core::mem::offset_of!(GB_apu_t, samples) - 4usize];
    ["Offset of field: GB_apu_t::is_active"][::core::mem::offset_of!(GB_apu_t, is_active) - 8usize];
    ["Offset of field: GB_apu_t::div_divider"]
        [::core::mem::offset_of!(GB_apu_t, div_divider) - 12usize];
    ["Offset of field: GB_apu_t::lf_div"][::core::mem::offset_of!(GB_apu_t, lf_div) - 13usize];
    ["Offset of field: GB_apu_t::square_sweep_countdown"]
        [::core::mem::offset_of!(GB_apu_t, square_sweep_countdown) - 14usize];
    ["Offset of field: GB_apu_t::square_sweep_calculate_countdown"]
        [::core::mem::offset_of!(GB_apu_t, square_sweep_calculate_countdown) - 15usize];
    ["Offset of field: GB_apu_t::square_sweep_calculate_countdown_reload_timer"][::core::mem::offset_of!(
        GB_apu_t,
        square_sweep_calculate_countdown_reload_timer
    ) - 16usize];
    ["Offset of field: GB_apu_t::sweep_length_addend"]
        [::core::mem::offset_of!(GB_apu_t, sweep_length_addend) - 18usize];
    ["Offset of field: GB_apu_t::shadow_sweep_sample_length"]
        [::core::mem::offset_of!(GB_apu_t, shadow_sweep_sample_length) - 20usize];
    ["Offset of field: GB_apu_t::unshifted_sweep"]
        [::core::mem::offset_of!(GB_apu_t, unshifted_sweep) - 22usize];
    ["Offset of field: GB_apu_t::square_sweep_instant_calculation_done"]
        [::core::mem::offset_of!(GB_apu_t, square_sweep_instant_calculation_done) - 23usize];
    ["Offset of field: GB_apu_t::channel_1_restart_hold"]
        [::core::mem::offset_of!(GB_apu_t, channel_1_restart_hold) - 24usize];
    ["Offset of field: GB_apu_t::channel1_completed_addend"]
        [::core::mem::offset_of!(GB_apu_t, channel1_completed_addend) - 26usize];
    ["Offset of field: GB_apu_t::square_channels"]
        [::core::mem::offset_of!(GB_apu_t, square_channels) - 28usize];
    ["Offset of field: GB_apu_t::wave_channel"]
        [::core::mem::offset_of!(GB_apu_t, wave_channel) - 56usize];
    ["Offset of field: GB_apu_t::noise_channel"]
        [::core::mem::offset_of!(GB_apu_t, noise_channel) - 74usize];
    ["Offset of field: GB_apu_t::skip_div_event"]
        [::core::mem::offset_of!(GB_apu_t, skip_div_event) - 92usize];
    ["Offset of field: GB_apu_t::pcm_mask"][::core::mem::offset_of!(GB_apu_t, pcm_mask) - 93usize];
    ["Offset of field: GB_apu_t::apu_cycles_in_2mhz"]
        [::core::mem::offset_of!(GB_apu_t, apu_cycles_in_2mhz) - 95usize];
    ["Offset of field: GB_apu_t::pending_envelope_tick"]
        [::core::mem::offset_of!(GB_apu_t, pending_envelope_tick) - 96usize];
};
pub const GB_highpass_mode_t_GB_HIGHPASS_OFF: GB_highpass_mode_t = 0;
pub const GB_highpass_mode_t_GB_HIGHPASS_ACCURATE: GB_highpass_mode_t = 1;
pub const GB_highpass_mode_t_GB_HIGHPASS_REMOVE_DC_OFFSET: GB_highpass_mode_t = 2;
pub const GB_highpass_mode_t_GB_HIGHPASS_MAX: GB_highpass_mode_t = 3;
pub type GB_highpass_mode_t = ::core::ffi::c_uint;
pub const GB_audio_format_t_GB_AUDIO_FORMAT_RAW: GB_audio_format_t = 0;
pub const GB_audio_format_t_GB_AUDIO_FORMAT_AIFF: GB_audio_format_t = 1;
pub const GB_audio_format_t_GB_AUDIO_FORMAT_WAV: GB_audio_format_t = 2;
pub type GB_audio_format_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_band_limited_t {
    pub buffer: [GB_band_limited_t__bindgen_ty_1; 128usize],
    pub output: GB_band_limited_t__bindgen_ty_1,
    pub pos: u8,
    pub input: GB_sample_t,
    pub last_output: GB_sample_t,
    pub silence_detection: ::core::ffi::c_uint,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_band_limited_t__bindgen_ty_1 {
    pub left: i32,
    pub right: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_band_limited_t__bindgen_ty_1"]
        [::core::mem::size_of::<GB_band_limited_t__bindgen_ty_1>() - 8usize];
    ["Alignment of GB_band_limited_t__bindgen_ty_1"]
        [::core::mem::align_of::<GB_band_limited_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: GB_band_limited_t__bindgen_ty_1::left"]
        [::core::mem::offset_of!(GB_band_limited_t__bindgen_ty_1, left) - 0usize];
    ["Offset of field: GB_band_limited_t__bindgen_ty_1::right"]
        [::core::mem::offset_of!(GB_band_limited_t__bindgen_ty_1, right) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_band_limited_t"][::core::mem::size_of::<GB_band_limited_t>() - 1048usize];
    ["Alignment of GB_band_limited_t"][::core::mem::align_of::<GB_band_limited_t>() - 4usize];
    ["Offset of field: GB_band_limited_t::buffer"]
        [::core::mem::offset_of!(GB_band_limited_t, buffer) - 0usize];
    ["Offset of field: GB_band_limited_t::output"]
        [::core::mem::offset_of!(GB_band_limited_t, output) - 1024usize];
    ["Offset of field: GB_band_limited_t::pos"]
        [::core::mem::offset_of!(GB_band_limited_t, pos) - 1032usize];
    ["Offset of field: GB_band_limited_t::input"]
        [::core::mem::offset_of!(GB_band_limited_t, input) - 1034usize];
    ["Offset of field: GB_band_limited_t::last_output"]
        [::core::mem::offset_of!(GB_band_limited_t, last_output) - 1038usize];
    ["Offset of field: GB_band_limited_t::silence_detection"]
        [::core::mem::offset_of!(GB_band_limited_t, silence_detection) - 1044usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_apu_output_t {
    pub sample_rate: ::core::ffi::c_uint,
    pub sample_cycles: ::core::ffi::c_uint,
    pub max_cycles_per_sample: ::core::ffi::c_uint,
    pub cycles_since_render: u32,
    pub sample_fraction: u32,
    pub quick_fraction_multiply_cache: [u32; 64usize],
    pub band_limited: [GB_band_limited_t; 4usize],
    pub dac_discharge: [f64; 4usize],
    pub channel_muted: [bool; 4usize],
    pub edge_triggered: [bool; 4usize],
    pub highpass_mode: GB_highpass_mode_t,
    pub highpass_rate: f64,
    pub highpass_diff: GB_double_sample_t,
    pub sample_callback: GB_sample_callback_t,
    pub interference_volume: f64,
    pub interference_highpass: f64,
    pub output_file: *mut FILE,
    pub output_format: GB_audio_format_t,
    pub output_error: ::core::ffi::c_int,
    pub square_sweep_disable_stepping: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_apu_output_t"][::core::mem::size_of::<GB_apu_output_t>() - 4592usize];
    ["Alignment of GB_apu_output_t"][::core::mem::align_of::<GB_apu_output_t>() - 8usize];
    ["Offset of field: GB_apu_output_t::sample_rate"]
        [::core::mem::offset_of!(GB_apu_output_t, sample_rate) - 0usize];
    ["Offset of field: GB_apu_output_t::sample_cycles"]
        [::core::mem::offset_of!(GB_apu_output_t, sample_cycles) - 4usize];
    ["Offset of field: GB_apu_output_t::max_cycles_per_sample"]
        [::core::mem::offset_of!(GB_apu_output_t, max_cycles_per_sample) - 8usize];
    ["Offset of field: GB_apu_output_t::cycles_since_render"]
        [::core::mem::offset_of!(GB_apu_output_t, cycles_since_render) - 12usize];
    ["Offset of field: GB_apu_output_t::sample_fraction"]
        [::core::mem::offset_of!(GB_apu_output_t, sample_fraction) - 16usize];
    ["Offset of field: GB_apu_output_t::quick_fraction_multiply_cache"]
        [::core::mem::offset_of!(GB_apu_output_t, quick_fraction_multiply_cache) - 20usize];
    ["Offset of field: GB_apu_output_t::band_limited"]
        [::core::mem::offset_of!(GB_apu_output_t, band_limited) - 276usize];
    ["Offset of field: GB_apu_output_t::dac_discharge"]
        [::core::mem::offset_of!(GB_apu_output_t, dac_discharge) - 4472usize];
    ["Offset of field: GB_apu_output_t::channel_muted"]
        [::core::mem::offset_of!(GB_apu_output_t, channel_muted) - 4504usize];
    ["Offset of field: GB_apu_output_t::edge_triggered"]
        [::core::mem::offset_of!(GB_apu_output_t, edge_triggered) - 4508usize];
    ["Offset of field: GB_apu_output_t::highpass_mode"]
        [::core::mem::offset_of!(GB_apu_output_t, highpass_mode) - 4512usize];
    ["Offset of field: GB_apu_output_t::highpass_rate"]
        [::core::mem::offset_of!(GB_apu_output_t, highpass_rate) - 4520usize];
    ["Offset of field: GB_apu_output_t::highpass_diff"]
        [::core::mem::offset_of!(GB_apu_output_t, highpass_diff) - 4528usize];
    ["Offset of field: GB_apu_output_t::sample_callback"]
        [::core::mem::offset_of!(GB_apu_output_t, sample_callback) - 4544usize];
    ["Offset of field: GB_apu_output_t::interference_volume"]
        [::core::mem::offset_of!(GB_apu_output_t, interference_volume) - 4552usize];
    ["Offset of field: GB_apu_output_t::interference_highpass"]
        [::core::mem::offset_of!(GB_apu_output_t, interference_highpass) - 4560usize];
    ["Offset of field: GB_apu_output_t::output_file"]
        [::core::mem::offset_of!(GB_apu_output_t, output_file) - 4568usize];
    ["Offset of field: GB_apu_output_t::output_format"]
        [::core::mem::offset_of!(GB_apu_output_t, output_format) - 4576usize];
    ["Offset of field: GB_apu_output_t::output_error"]
        [::core::mem::offset_of!(GB_apu_output_t, output_error) - 4580usize];
    ["Offset of field: GB_apu_output_t::square_sweep_disable_stepping"]
        [::core::mem::offset_of!(GB_apu_output_t, square_sweep_disable_stepping) - 4584usize];
};
unsafe extern "C" {
    pub fn GB_set_channel_muted(gb: *mut GB_gameboy_t, channel: GB_channel_t, muted: bool);
}
unsafe extern "C" {
    pub fn GB_is_channel_muted(gb: *mut GB_gameboy_t, channel: GB_channel_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_set_sample_rate(gb: *mut GB_gameboy_t, sample_rate: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn GB_get_sample_rate(gb: *mut GB_gameboy_t) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn GB_set_sample_rate_by_clocks(gb: *mut GB_gameboy_t, cycles_per_sample: f64);
}
unsafe extern "C" {
    pub fn GB_set_highpass_filter_mode(gb: *mut GB_gameboy_t, mode: GB_highpass_mode_t);
}
unsafe extern "C" {
    pub fn GB_set_interference_volume(gb: *mut GB_gameboy_t, volume: f64);
}
unsafe extern "C" {
    pub fn GB_apu_set_sample_callback(gb: *mut GB_gameboy_t, callback: GB_sample_callback_t);
}
unsafe extern "C" {
    pub fn GB_start_audio_recording(
        gb: *mut GB_gameboy_t,
        path: *const ::core::ffi::c_char,
        format: GB_audio_format_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GB_stop_audio_recording(gb: *mut GB_gameboy_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GB_get_channel_volume(gb: *mut GB_gameboy_t, channel: GB_channel_t) -> u8;
}
unsafe extern "C" {
    pub fn GB_get_channel_amplitude(gb: *mut GB_gameboy_t, channel: GB_channel_t) -> u8;
}
unsafe extern "C" {
    pub fn GB_get_channel_period(gb: *mut GB_gameboy_t, channel: GB_channel_t) -> u16;
}
unsafe extern "C" {
    pub fn GB_get_apu_wave_table(gb: *mut GB_gameboy_t, wave_table: *mut u8);
}
unsafe extern "C" {
    pub fn GB_get_channel_edge_triggered(gb: *mut GB_gameboy_t, channel: GB_channel_t) -> bool;
}
pub type GB_camera_get_pixel_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, x: u8, y: u8) -> u8>;
pub type GB_camera_update_request_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t)>;
unsafe extern "C" {
    pub fn GB_set_camera_get_pixel_callback(
        gb: *mut GB_gameboy_t,
        callback: GB_camera_get_pixel_callback_t,
    );
}
unsafe extern "C" {
    pub fn GB_set_camera_update_request_callback(
        gb: *mut GB_gameboy_t,
        callback: GB_camera_update_request_callback_t,
    );
}
unsafe extern "C" {
    pub fn GB_camera_updated(gb: *mut GB_gameboy_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_bank_symbol_t {
    pub name: *mut ::core::ffi::c_char,
    pub addr: u16,
    pub is_local: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_bank_symbol_t"][::core::mem::size_of::<GB_bank_symbol_t>() - 16usize];
    ["Alignment of GB_bank_symbol_t"][::core::mem::align_of::<GB_bank_symbol_t>() - 8usize];
    ["Offset of field: GB_bank_symbol_t::name"]
        [::core::mem::offset_of!(GB_bank_symbol_t, name) - 0usize];
    ["Offset of field: GB_bank_symbol_t::addr"]
        [::core::mem::offset_of!(GB_bank_symbol_t, addr) - 8usize];
    ["Offset of field: GB_bank_symbol_t::is_local"]
        [::core::mem::offset_of!(GB_bank_symbol_t, is_local) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_symbol_s {
    pub next: *mut GB_symbol_s,
    pub name: *const ::core::ffi::c_char,
    pub bank: u16,
    pub addr: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_symbol_s"][::core::mem::size_of::<GB_symbol_s>() - 24usize];
    ["Alignment of GB_symbol_s"][::core::mem::align_of::<GB_symbol_s>() - 8usize];
    ["Offset of field: GB_symbol_s::next"][::core::mem::offset_of!(GB_symbol_s, next) - 0usize];
    ["Offset of field: GB_symbol_s::name"][::core::mem::offset_of!(GB_symbol_s, name) - 8usize];
    ["Offset of field: GB_symbol_s::bank"][::core::mem::offset_of!(GB_symbol_s, bank) - 16usize];
    ["Offset of field: GB_symbol_s::addr"][::core::mem::offset_of!(GB_symbol_s, addr) - 18usize];
};
pub type GB_symbol_t = GB_symbol_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_symbol_map_t {
    pub symbols: *mut GB_bank_symbol_t,
    pub n_symbols: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_symbol_map_t"][::core::mem::size_of::<GB_symbol_map_t>() - 16usize];
    ["Alignment of GB_symbol_map_t"][::core::mem::align_of::<GB_symbol_map_t>() - 8usize];
    ["Offset of field: GB_symbol_map_t::symbols"]
        [::core::mem::offset_of!(GB_symbol_map_t, symbols) - 0usize];
    ["Offset of field: GB_symbol_map_t::n_symbols"]
        [::core::mem::offset_of!(GB_symbol_map_t, n_symbols) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_reversed_symbol_map_t {
    pub buckets: [*mut GB_symbol_t; 8192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_reversed_symbol_map_t"]
        [::core::mem::size_of::<GB_reversed_symbol_map_t>() - 65536usize];
    ["Alignment of GB_reversed_symbol_map_t"]
        [::core::mem::align_of::<GB_reversed_symbol_map_t>() - 8usize];
    ["Offset of field: GB_reversed_symbol_map_t::buckets"]
        [::core::mem::offset_of!(GB_reversed_symbol_map_t, buckets) - 0usize];
};
pub type GB_debugger_reload_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t)>;
unsafe extern "C" {
    pub fn GB_debugger_break(gb: *mut GB_gameboy_t);
}
unsafe extern "C" {
    pub fn GB_debugger_execute_command(gb: *mut GB_gameboy_t, input: *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn GB_debugger_complete_substring(
        gb: *mut GB_gameboy_t,
        input: *mut ::core::ffi::c_char,
        context: *mut usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GB_debugger_load_symbol_file(gb: *mut GB_gameboy_t, path: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn GB_debugger_name_for_address(
        gb: *mut GB_gameboy_t,
        addr: u16,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GB_debugger_describe_address(
        gb: *mut GB_gameboy_t,
        addr: u16,
        bank: u16,
        exact_match: bool,
        prefer_local: bool,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GB_debugger_evaluate(
        gb: *mut GB_gameboy_t,
        string: *const ::core::ffi::c_char,
        result: *mut u16,
        result_bank: *mut u16,
    ) -> bool;
}
unsafe extern "C" {
    pub fn GB_debugger_is_stopped(gb: *mut GB_gameboy_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_debugger_set_disabled(gb: *mut GB_gameboy_t, disabled: bool);
}
unsafe extern "C" {
    pub fn GB_debugger_clear_symbols(gb: *mut GB_gameboy_t);
}
unsafe extern "C" {
    pub fn GB_debugger_set_reload_callback(
        gb: *mut GB_gameboy_t,
        callback: GB_debugger_reload_callback_t,
    );
}
unsafe extern "C" {
    pub fn GB_debugger_get_frame_cpu_usage(gb: *mut GB_gameboy_t) -> f64;
}
unsafe extern "C" {
    pub fn GB_debugger_get_second_cpu_usage(gb: *mut GB_gameboy_t) -> f64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_palette_t {
    pub colors: [GB_palette_t_GB_color_s; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_palette_t_GB_color_s {
    pub r: u8,
    pub g: u8,
    pub b: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_palette_t_GB_color_s"][::core::mem::size_of::<GB_palette_t_GB_color_s>() - 3usize];
    ["Alignment of GB_palette_t_GB_color_s"]
        [::core::mem::align_of::<GB_palette_t_GB_color_s>() - 1usize];
    ["Offset of field: GB_palette_t_GB_color_s::r"]
        [::core::mem::offset_of!(GB_palette_t_GB_color_s, r) - 0usize];
    ["Offset of field: GB_palette_t_GB_color_s::g"]
        [::core::mem::offset_of!(GB_palette_t_GB_color_s, g) - 1usize];
    ["Offset of field: GB_palette_t_GB_color_s::b"]
        [::core::mem::offset_of!(GB_palette_t_GB_color_s, b) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_palette_t"][::core::mem::size_of::<GB_palette_t>() - 15usize];
    ["Alignment of GB_palette_t"][::core::mem::align_of::<GB_palette_t>() - 1usize];
    ["Offset of field: GB_palette_t::colors"]
        [::core::mem::offset_of!(GB_palette_t, colors) - 0usize];
};
pub const GB_vblank_type_t_GB_VBLANK_TYPE_NORMAL_FRAME: GB_vblank_type_t = 0;
pub const GB_vblank_type_t_GB_VBLANK_TYPE_LCD_OFF: GB_vblank_type_t = 1;
pub const GB_vblank_type_t_GB_VBLANK_TYPE_ARTIFICIAL: GB_vblank_type_t = 2;
pub const GB_vblank_type_t_GB_VBLANK_TYPE_REPEAT: GB_vblank_type_t = 3;
pub const GB_vblank_type_t_GB_VBLANK_TYPE_SKIPPED_FRAME: GB_vblank_type_t = 4;
pub type GB_vblank_type_t = ::core::ffi::c_uint;
pub type GB_vblank_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, type_: GB_vblank_type_t)>;
pub type GB_rgb_encode_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, r: u8, g: u8, b: u8) -> u32>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_fifo_item_t {
    pub pixel: u8,
    pub palette: u8,
    pub priority: u8,
    pub bg_priority: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_fifo_item_t"][::core::mem::size_of::<GB_fifo_item_t>() - 4usize];
    ["Alignment of GB_fifo_item_t"][::core::mem::align_of::<GB_fifo_item_t>() - 1usize];
    ["Offset of field: GB_fifo_item_t::pixel"]
        [::core::mem::offset_of!(GB_fifo_item_t, pixel) - 0usize];
    ["Offset of field: GB_fifo_item_t::palette"]
        [::core::mem::offset_of!(GB_fifo_item_t, palette) - 1usize];
    ["Offset of field: GB_fifo_item_t::priority"]
        [::core::mem::offset_of!(GB_fifo_item_t, priority) - 2usize];
    ["Offset of field: GB_fifo_item_t::bg_priority"]
        [::core::mem::offset_of!(GB_fifo_item_t, bg_priority) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_fifo_t {
    pub fifo: [GB_fifo_item_t; 8usize],
    pub read_end: u8,
    pub size: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_fifo_t"][::core::mem::size_of::<GB_fifo_t>() - 34usize];
    ["Alignment of GB_fifo_t"][::core::mem::align_of::<GB_fifo_t>() - 1usize];
    ["Offset of field: GB_fifo_t::fifo"][::core::mem::offset_of!(GB_fifo_t, fifo) - 0usize];
    ["Offset of field: GB_fifo_t::read_end"]
        [::core::mem::offset_of!(GB_fifo_t, read_end) - 32usize];
    ["Offset of field: GB_fifo_t::size"][::core::mem::offset_of!(GB_fifo_t, size) - 33usize];
};
pub const GB_palette_type_t_GB_PALETTE_NONE: GB_palette_type_t = 0;
pub const GB_palette_type_t_GB_PALETTE_BACKGROUND: GB_palette_type_t = 1;
pub const GB_palette_type_t_GB_PALETTE_OAM: GB_palette_type_t = 2;
pub const GB_palette_type_t_GB_PALETTE_AUTO: GB_palette_type_t = 3;
pub type GB_palette_type_t = ::core::ffi::c_uint;
pub const GB_map_type_t_GB_MAP_AUTO: GB_map_type_t = 0;
pub const GB_map_type_t_GB_MAP_9800: GB_map_type_t = 1;
pub const GB_map_type_t_GB_MAP_9C00: GB_map_type_t = 2;
pub type GB_map_type_t = ::core::ffi::c_uint;
pub const GB_tileset_type_t_GB_TILESET_AUTO: GB_tileset_type_t = 0;
pub const GB_tileset_type_t_GB_TILESET_8800: GB_tileset_type_t = 1;
pub const GB_tileset_type_t_GB_TILESET_8000: GB_tileset_type_t = 2;
pub type GB_tileset_type_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_oam_info_t {
    pub image: [u32; 128usize],
    pub x: u8,
    pub y: u8,
    pub tile: u8,
    pub flags: u8,
    pub oam_addr: u16,
    pub obscured_by_line_limit: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_oam_info_t"][::core::mem::size_of::<GB_oam_info_t>() - 520usize];
    ["Alignment of GB_oam_info_t"][::core::mem::align_of::<GB_oam_info_t>() - 4usize];
    ["Offset of field: GB_oam_info_t::image"]
        [::core::mem::offset_of!(GB_oam_info_t, image) - 0usize];
    ["Offset of field: GB_oam_info_t::x"][::core::mem::offset_of!(GB_oam_info_t, x) - 512usize];
    ["Offset of field: GB_oam_info_t::y"][::core::mem::offset_of!(GB_oam_info_t, y) - 513usize];
    ["Offset of field: GB_oam_info_t::tile"]
        [::core::mem::offset_of!(GB_oam_info_t, tile) - 514usize];
    ["Offset of field: GB_oam_info_t::flags"]
        [::core::mem::offset_of!(GB_oam_info_t, flags) - 515usize];
    ["Offset of field: GB_oam_info_t::oam_addr"]
        [::core::mem::offset_of!(GB_oam_info_t, oam_addr) - 516usize];
    ["Offset of field: GB_oam_info_t::obscured_by_line_limit"]
        [::core::mem::offset_of!(GB_oam_info_t, obscured_by_line_limit) - 518usize];
};
pub const GB_color_correction_mode_t_GB_COLOR_CORRECTION_DISABLED: GB_color_correction_mode_t = 0;
pub const GB_color_correction_mode_t_GB_COLOR_CORRECTION_CORRECT_CURVES:
    GB_color_correction_mode_t = 1;
pub const GB_color_correction_mode_t_GB_COLOR_CORRECTION_MODERN_BALANCED:
    GB_color_correction_mode_t = 2;
pub const GB_color_correction_mode_t_GB_COLOR_CORRECTION_MODERN_BOOST_CONTRAST:
    GB_color_correction_mode_t = 3;
pub const GB_color_correction_mode_t_GB_COLOR_CORRECTION_REDUCE_CONTRAST:
    GB_color_correction_mode_t = 4;
pub const GB_color_correction_mode_t_GB_COLOR_CORRECTION_LOW_CONTRAST: GB_color_correction_mode_t =
    5;
pub const GB_color_correction_mode_t_GB_COLOR_CORRECTION_MODERN_ACCURATE:
    GB_color_correction_mode_t = 6;
pub type GB_color_correction_mode_t = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn GB_set_vblank_callback(gb: *mut GB_gameboy_t, callback: GB_vblank_callback_t);
}
unsafe extern "C" {
    pub fn GB_set_enable_skipped_frame_vblank_callbacks(gb: *mut GB_gameboy_t, enable: bool);
}
unsafe extern "C" {
    pub fn GB_set_rgb_encode_callback(gb: *mut GB_gameboy_t, callback: GB_rgb_encode_callback_t);
}
unsafe extern "C" {
    pub fn GB_set_palette(gb: *mut GB_gameboy_t, palette: *const GB_palette_t);
}
unsafe extern "C" {
    pub fn GB_get_palette(gb: *mut GB_gameboy_t) -> *const GB_palette_t;
}
unsafe extern "C" {
    pub fn GB_set_color_correction_mode(gb: *mut GB_gameboy_t, mode: GB_color_correction_mode_t);
}
unsafe extern "C" {
    pub fn GB_set_light_temperature(gb: *mut GB_gameboy_t, temperature: f64);
}
unsafe extern "C" {
    pub fn GB_set_pixels_output(gb: *mut GB_gameboy_t, output: *mut u32);
}
unsafe extern "C" {
    pub fn GB_get_screen_width(gb: *mut GB_gameboy_t) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn GB_get_screen_height(gb: *mut GB_gameboy_t) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn GB_get_usual_frame_rate(gb: *mut GB_gameboy_t) -> f64;
}
unsafe extern "C" {
    pub fn GB_is_odd_frame(gb: *mut GB_gameboy_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_convert_rgb15(gb: *mut GB_gameboy_t, color: u16, for_border: bool) -> u32;
}
unsafe extern "C" {
    pub fn GB_draw_tileset(
        gb: *mut GB_gameboy_t,
        dest: *mut u32,
        palette_type: GB_palette_type_t,
        palette_index: u8,
    );
}
unsafe extern "C" {
    pub fn GB_draw_tilemap(
        gb: *mut GB_gameboy_t,
        dest: *mut u32,
        palette_type: GB_palette_type_t,
        palette_index: u8,
        map_type: GB_map_type_t,
        tileset_type: GB_tileset_type_t,
    );
}
unsafe extern "C" {
    pub fn GB_get_oam_info(
        gb: *mut GB_gameboy_t,
        dest: *mut GB_oam_info_t,
        object_height: *mut u8,
    ) -> u8;
}
unsafe extern "C" {
    pub fn GB_set_object_rendering_disabled(gb: *mut GB_gameboy_t, disabled: bool);
}
unsafe extern "C" {
    pub fn GB_set_background_rendering_disabled(gb: *mut GB_gameboy_t, disabled: bool);
}
unsafe extern "C" {
    pub fn GB_is_object_rendering_disabled(gb: *mut GB_gameboy_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_is_background_rendering_disabled(gb: *mut GB_gameboy_t) -> bool;
}
pub const GB_key_t_GB_KEY_RIGHT: GB_key_t = 0;
pub const GB_key_t_GB_KEY_LEFT: GB_key_t = 1;
pub const GB_key_t_GB_KEY_UP: GB_key_t = 2;
pub const GB_key_t_GB_KEY_DOWN: GB_key_t = 3;
pub const GB_key_t_GB_KEY_A: GB_key_t = 4;
pub const GB_key_t_GB_KEY_B: GB_key_t = 5;
pub const GB_key_t_GB_KEY_SELECT: GB_key_t = 6;
pub const GB_key_t_GB_KEY_START: GB_key_t = 7;
pub const GB_key_t_GB_KEY_MAX: GB_key_t = 8;
pub type GB_key_t = ::core::ffi::c_uint;
pub const GB_key_mask_t_GB_KEY_RIGHT_MASK: GB_key_mask_t = 1;
pub const GB_key_mask_t_GB_KEY_LEFT_MASK: GB_key_mask_t = 2;
pub const GB_key_mask_t_GB_KEY_UP_MASK: GB_key_mask_t = 4;
pub const GB_key_mask_t_GB_KEY_DOWN_MASK: GB_key_mask_t = 8;
pub const GB_key_mask_t_GB_KEY_A_MASK: GB_key_mask_t = 16;
pub const GB_key_mask_t_GB_KEY_B_MASK: GB_key_mask_t = 32;
pub const GB_key_mask_t_GB_KEY_SELECT_MASK: GB_key_mask_t = 64;
pub const GB_key_mask_t_GB_KEY_START_MASK: GB_key_mask_t = 128;
pub type GB_key_mask_t = ::core::ffi::c_uint;
pub type GB_update_input_hint_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t)>;
unsafe extern "C" {
    pub fn GB_set_key_state(gb: *mut GB_gameboy_t, index: GB_key_t, pressed: bool);
}
unsafe extern "C" {
    pub fn GB_set_key_state_for_player(
        gb: *mut GB_gameboy_t,
        index: GB_key_t,
        player: ::core::ffi::c_uint,
        pressed: bool,
    );
}
unsafe extern "C" {
    pub fn GB_set_key_mask(gb: *mut GB_gameboy_t, mask: GB_key_mask_t);
}
unsafe extern "C" {
    pub fn GB_set_key_mask_for_player(
        gb: *mut GB_gameboy_t,
        mask: GB_key_mask_t,
        player: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    pub fn GB_icd_set_joyp(gb: *mut GB_gameboy_t, value: u8);
}
unsafe extern "C" {
    pub fn GB_get_joyp_accessed(gb: *mut GB_gameboy_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_clear_joyp_accessed(gb: *mut GB_gameboy_t);
}
unsafe extern "C" {
    pub fn GB_set_allow_illegal_inputs(gb: *mut GB_gameboy_t, allow: bool);
}
unsafe extern "C" {
    pub fn GB_set_emulate_joypad_bouncing(gb: *mut GB_gameboy_t, emulate: bool);
}
unsafe extern "C" {
    pub fn GB_set_update_input_hint_callback(
        gb: *mut GB_gameboy_t,
        callback: GB_update_input_hint_callback_t,
    );
}
unsafe extern "C" {
    pub fn GB_set_use_faux_analog_inputs(
        gb: *mut GB_gameboy_t,
        player: ::core::ffi::c_uint,
        use_: bool,
    );
}
unsafe extern "C" {
    pub fn GB_set_faux_analog_inputs(
        gb: *mut GB_gameboy_t,
        player: ::core::ffi::c_uint,
        x: f64,
        y: f64,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_cartridge_t {
    pub mbc_type: GB_cartridge_t__bindgen_ty_1,
    pub has_ram: bool,
    pub has_battery: bool,
    pub has_rtc: bool,
    pub has_rumble: bool,
}
pub const GB_cartridge_t_GB_NO_MBC: GB_cartridge_t__bindgen_ty_1 = 0;
pub const GB_cartridge_t_GB_MBC1: GB_cartridge_t__bindgen_ty_1 = 1;
pub const GB_cartridge_t_GB_MBC2: GB_cartridge_t__bindgen_ty_1 = 2;
pub const GB_cartridge_t_GB_MBC3: GB_cartridge_t__bindgen_ty_1 = 3;
pub const GB_cartridge_t_GB_MBC5: GB_cartridge_t__bindgen_ty_1 = 4;
pub const GB_cartridge_t_GB_MBC7: GB_cartridge_t__bindgen_ty_1 = 5;
pub const GB_cartridge_t_GB_MMM01: GB_cartridge_t__bindgen_ty_1 = 6;
pub const GB_cartridge_t_GB_HUC1: GB_cartridge_t__bindgen_ty_1 = 7;
pub const GB_cartridge_t_GB_HUC3: GB_cartridge_t__bindgen_ty_1 = 8;
pub const GB_cartridge_t_GB_TPP1: GB_cartridge_t__bindgen_ty_1 = 9;
pub const GB_cartridge_t_GB_CAMERA: GB_cartridge_t__bindgen_ty_1 = 10;
pub type GB_cartridge_t__bindgen_ty_1 = ::core::ffi::c_uint;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_cartridge_t"][::core::mem::size_of::<GB_cartridge_t>() - 8usize];
    ["Alignment of GB_cartridge_t"][::core::mem::align_of::<GB_cartridge_t>() - 4usize];
    ["Offset of field: GB_cartridge_t::mbc_type"]
        [::core::mem::offset_of!(GB_cartridge_t, mbc_type) - 0usize];
    ["Offset of field: GB_cartridge_t::has_ram"]
        [::core::mem::offset_of!(GB_cartridge_t, has_ram) - 4usize];
    ["Offset of field: GB_cartridge_t::has_battery"]
        [::core::mem::offset_of!(GB_cartridge_t, has_battery) - 5usize];
    ["Offset of field: GB_cartridge_t::has_rtc"]
        [::core::mem::offset_of!(GB_cartridge_t, has_rtc) - 6usize];
    ["Offset of field: GB_cartridge_t::has_rumble"]
        [::core::mem::offset_of!(GB_cartridge_t, has_rumble) - 7usize];
};
pub type GB_read_memory_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, addr: u16, data: u8) -> u8>;
pub type GB_write_memory_callback_t = ::core::option::Option<
    unsafe extern "C" fn(gb: *mut GB_gameboy_t, addr: u16, data: u8) -> bool,
>;
unsafe extern "C" {
    pub fn GB_set_read_memory_callback(gb: *mut GB_gameboy_t, callback: GB_read_memory_callback_t);
}
unsafe extern "C" {
    pub fn GB_set_write_memory_callback(
        gb: *mut GB_gameboy_t,
        callback: GB_write_memory_callback_t,
    );
}
unsafe extern "C" {
    pub fn GB_read_memory(gb: *mut GB_gameboy_t, addr: u16) -> u8;
}
unsafe extern "C" {
    pub fn GB_safe_read_memory(gb: *mut GB_gameboy_t, addr: u16) -> u8;
}
unsafe extern "C" {
    pub fn GB_write_memory(gb: *mut GB_gameboy_t, addr: u16, value: u8);
}
pub type GB_print_image_callback_t = ::core::option::Option<
    unsafe extern "C" fn(
        gb: *mut GB_gameboy_t,
        image: *mut u32,
        height: u8,
        top_margin: u8,
        bottom_margin: u8,
        exposure: u8,
    ),
>;
pub type GB_printer_done_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_printer_t {
    pub command_state: GB_printer_t__bindgen_ty_1,
    pub command_id: GB_printer_t__bindgen_ty_2,
    pub compression: bool,
    pub length_left: u16,
    pub command_data: [u8; 640usize],
    pub command_length: u16,
    pub checksum: u16,
    pub status: u8,
    pub byte_to_send: u8,
    pub image: [u8; 32000usize],
    pub image_offset: u16,
    pub idle_time: u32,
    pub time_remaining: u32,
    pub compression_run_lenth: u8,
    pub compression_run_is_compressed: bool,
    pub bits_received: u8,
    pub byte_being_received: u8,
    pub bit_to_send: bool,
}
pub const GB_printer_t_GB_PRINTER_COMMAND_MAGIC1: GB_printer_t__bindgen_ty_1 = 0;
pub const GB_printer_t_GB_PRINTER_COMMAND_MAGIC2: GB_printer_t__bindgen_ty_1 = 1;
pub const GB_printer_t_GB_PRINTER_COMMAND_ID: GB_printer_t__bindgen_ty_1 = 2;
pub const GB_printer_t_GB_PRINTER_COMMAND_COMPRESSION: GB_printer_t__bindgen_ty_1 = 3;
pub const GB_printer_t_GB_PRINTER_COMMAND_LENGTH_LOW: GB_printer_t__bindgen_ty_1 = 4;
pub const GB_printer_t_GB_PRINTER_COMMAND_LENGTH_HIGH: GB_printer_t__bindgen_ty_1 = 5;
pub const GB_printer_t_GB_PRINTER_COMMAND_DATA: GB_printer_t__bindgen_ty_1 = 6;
pub const GB_printer_t_GB_PRINTER_COMMAND_CHECKSUM_LOW: GB_printer_t__bindgen_ty_1 = 7;
pub const GB_printer_t_GB_PRINTER_COMMAND_CHECKSUM_HIGH: GB_printer_t__bindgen_ty_1 = 8;
pub const GB_printer_t_GB_PRINTER_COMMAND_ACTIVE: GB_printer_t__bindgen_ty_1 = 9;
pub const GB_printer_t_GB_PRINTER_COMMAND_STATUS: GB_printer_t__bindgen_ty_1 = 10;
pub type GB_printer_t__bindgen_ty_1 = u8;
pub const GB_printer_t_GB_PRINTER_INIT_COMMAND: GB_printer_t__bindgen_ty_2 = 1;
pub const GB_printer_t_GB_PRINTER_START_COMMAND: GB_printer_t__bindgen_ty_2 = 2;
pub const GB_printer_t_GB_PRINTER_DATA_COMMAND: GB_printer_t__bindgen_ty_2 = 4;
pub const GB_printer_t_GB_PRINTER_NOP_COMMAND: GB_printer_t__bindgen_ty_2 = 15;
pub type GB_printer_t__bindgen_ty_2 = u8;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_printer_t"][::core::mem::size_of::<GB_printer_t>() - 32672usize];
    ["Alignment of GB_printer_t"][::core::mem::align_of::<GB_printer_t>() - 4usize];
    ["Offset of field: GB_printer_t::command_state"]
        [::core::mem::offset_of!(GB_printer_t, command_state) - 0usize];
    ["Offset of field: GB_printer_t::command_id"]
        [::core::mem::offset_of!(GB_printer_t, command_id) - 1usize];
    ["Offset of field: GB_printer_t::compression"]
        [::core::mem::offset_of!(GB_printer_t, compression) - 2usize];
    ["Offset of field: GB_printer_t::length_left"]
        [::core::mem::offset_of!(GB_printer_t, length_left) - 4usize];
    ["Offset of field: GB_printer_t::command_data"]
        [::core::mem::offset_of!(GB_printer_t, command_data) - 6usize];
    ["Offset of field: GB_printer_t::command_length"]
        [::core::mem::offset_of!(GB_printer_t, command_length) - 646usize];
    ["Offset of field: GB_printer_t::checksum"]
        [::core::mem::offset_of!(GB_printer_t, checksum) - 648usize];
    ["Offset of field: GB_printer_t::status"]
        [::core::mem::offset_of!(GB_printer_t, status) - 650usize];
    ["Offset of field: GB_printer_t::byte_to_send"]
        [::core::mem::offset_of!(GB_printer_t, byte_to_send) - 651usize];
    ["Offset of field: GB_printer_t::image"]
        [::core::mem::offset_of!(GB_printer_t, image) - 652usize];
    ["Offset of field: GB_printer_t::image_offset"]
        [::core::mem::offset_of!(GB_printer_t, image_offset) - 32652usize];
    ["Offset of field: GB_printer_t::idle_time"]
        [::core::mem::offset_of!(GB_printer_t, idle_time) - 32656usize];
    ["Offset of field: GB_printer_t::time_remaining"]
        [::core::mem::offset_of!(GB_printer_t, time_remaining) - 32660usize];
    ["Offset of field: GB_printer_t::compression_run_lenth"]
        [::core::mem::offset_of!(GB_printer_t, compression_run_lenth) - 32664usize];
    ["Offset of field: GB_printer_t::compression_run_is_compressed"]
        [::core::mem::offset_of!(GB_printer_t, compression_run_is_compressed) - 32665usize];
    ["Offset of field: GB_printer_t::bits_received"]
        [::core::mem::offset_of!(GB_printer_t, bits_received) - 32666usize];
    ["Offset of field: GB_printer_t::byte_being_received"]
        [::core::mem::offset_of!(GB_printer_t, byte_being_received) - 32667usize];
    ["Offset of field: GB_printer_t::bit_to_send"]
        [::core::mem::offset_of!(GB_printer_t, bit_to_send) - 32668usize];
};
unsafe extern "C" {
    pub fn GB_connect_printer(
        gb: *mut GB_gameboy_t,
        callback: GB_print_image_callback_t,
        done_callback: GB_printer_done_callback_t,
    );
}
pub const GB_rtc_mode_t_GB_RTC_MODE_SYNC_TO_HOST: GB_rtc_mode_t = 0;
pub const GB_rtc_mode_t_GB_RTC_MODE_ACCURATE: GB_rtc_mode_t = 1;
pub type GB_rtc_mode_t = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn GB_set_rtc_mode(gb: *mut GB_gameboy_t, mode: GB_rtc_mode_t);
}
unsafe extern "C" {
    pub fn GB_set_rtc_multiplier(gb: *mut GB_gameboy_t, multiplier: f64);
}
unsafe extern "C" {
    pub fn GB_rewind_pop(gb: *mut GB_gameboy_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_set_rewind_length(gb: *mut GB_gameboy_t, seconds: f64);
}
unsafe extern "C" {
    pub fn GB_rewind_reset(gb: *mut GB_gameboy_t);
}
unsafe extern "C" {
    pub fn GB_cpu_disassemble(gb: *mut GB_gameboy_t, pc: u16, count: u16);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_sgb_s {
    _unused: [u8; 0],
}
pub type GB_sgb_t = GB_sgb_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_sgb_border_t {
    pub tiles: [u8; 8192usize],
    pub raw_data: [u16; 1088usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_sgb_border_t"][::core::mem::size_of::<GB_sgb_border_t>() - 10368usize];
    ["Alignment of GB_sgb_border_t"][::core::mem::align_of::<GB_sgb_border_t>() - 2usize];
    ["Offset of field: GB_sgb_border_t::tiles"]
        [::core::mem::offset_of!(GB_sgb_border_t, tiles) - 0usize];
    ["Offset of field: GB_sgb_border_t::raw_data"]
        [::core::mem::offset_of!(GB_sgb_border_t, raw_data) - 8192usize];
};
unsafe extern "C" {
    pub fn GB_get_player_count(gb: *mut GB_gameboy_t) -> ::core::ffi::c_uint;
}
pub type GB_cheat_t = GB_cheat_s;
unsafe extern "C" {
    pub fn GB_add_cheat(
        gb: *mut GB_gameboy_t,
        description: *const ::core::ffi::c_char,
        address: u16,
        bank: u16,
        value: u8,
        old_value: u8,
        use_old_value: bool,
        enabled: bool,
    ) -> *const GB_cheat_t;
}
unsafe extern "C" {
    pub fn GB_update_cheat(
        gb: *mut GB_gameboy_t,
        cheat: *const GB_cheat_t,
        description: *const ::core::ffi::c_char,
        address: u16,
        bank: u16,
        value: u8,
        old_value: u8,
        use_old_value: bool,
        enabled: bool,
    );
}
unsafe extern "C" {
    pub fn GB_import_cheat(
        gb: *mut GB_gameboy_t,
        cheat: *const ::core::ffi::c_char,
        description: *const ::core::ffi::c_char,
        enabled: bool,
    ) -> *const GB_cheat_t;
}
unsafe extern "C" {
    pub fn GB_get_cheats(gb: *mut GB_gameboy_t, size: *mut usize) -> *const *const GB_cheat_t;
}
unsafe extern "C" {
    pub fn GB_remove_cheat(gb: *mut GB_gameboy_t, cheat: *const GB_cheat_t);
}
unsafe extern "C" {
    pub fn GB_remove_all_cheats(gb: *mut GB_gameboy_t);
}
unsafe extern "C" {
    pub fn GB_cheats_enabled(gb: *mut GB_gameboy_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_set_cheats_enabled(gb: *mut GB_gameboy_t, enabled: bool);
}
unsafe extern "C" {
    pub fn GB_load_cheats(
        gb: *mut GB_gameboy_t,
        path: *const ::core::ffi::c_char,
        replace_existing: bool,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GB_save_cheats(
        gb: *mut GB_gameboy_t,
        path: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug)]
pub struct GB_cheat_hash_t {
    pub size: usize,
    pub cheats: __IncompleteArrayField<*mut GB_cheat_t>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_cheat_hash_t"][::core::mem::size_of::<GB_cheat_hash_t>() - 8usize];
    ["Alignment of GB_cheat_hash_t"][::core::mem::align_of::<GB_cheat_hash_t>() - 8usize];
    ["Offset of field: GB_cheat_hash_t::size"]
        [::core::mem::offset_of!(GB_cheat_hash_t, size) - 0usize];
    ["Offset of field: GB_cheat_hash_t::cheats"]
        [::core::mem::offset_of!(GB_cheat_hash_t, cheats) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_cheat_s {
    pub address: u16,
    pub bank: u16,
    pub value: u8,
    pub old_value: u8,
    pub use_old_value: bool,
    pub enabled: bool,
    pub description: [::core::ffi::c_char; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_cheat_s"][::core::mem::size_of::<GB_cheat_s>() - 136usize];
    ["Alignment of GB_cheat_s"][::core::mem::align_of::<GB_cheat_s>() - 2usize];
    ["Offset of field: GB_cheat_s::address"][::core::mem::offset_of!(GB_cheat_s, address) - 0usize];
    ["Offset of field: GB_cheat_s::bank"][::core::mem::offset_of!(GB_cheat_s, bank) - 2usize];
    ["Offset of field: GB_cheat_s::value"][::core::mem::offset_of!(GB_cheat_s, value) - 4usize];
    ["Offset of field: GB_cheat_s::old_value"]
        [::core::mem::offset_of!(GB_cheat_s, old_value) - 5usize];
    ["Offset of field: GB_cheat_s::use_old_value"]
        [::core::mem::offset_of!(GB_cheat_s, use_old_value) - 6usize];
    ["Offset of field: GB_cheat_s::enabled"][::core::mem::offset_of!(GB_cheat_s, enabled) - 7usize];
    ["Offset of field: GB_cheat_s::description"]
        [::core::mem::offset_of!(GB_cheat_s, description) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_cheat_search_result_t {
    pub addr: u16,
    pub bank: u16,
    pub value: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_cheat_search_result_t"]
        [::core::mem::size_of::<GB_cheat_search_result_t>() - 6usize];
    ["Alignment of GB_cheat_search_result_t"]
        [::core::mem::align_of::<GB_cheat_search_result_t>() - 2usize];
    ["Offset of field: GB_cheat_search_result_t::addr"]
        [::core::mem::offset_of!(GB_cheat_search_result_t, addr) - 0usize];
    ["Offset of field: GB_cheat_search_result_t::bank"]
        [::core::mem::offset_of!(GB_cheat_search_result_t, bank) - 2usize];
    ["Offset of field: GB_cheat_search_result_t::value"]
        [::core::mem::offset_of!(GB_cheat_search_result_t, value) - 4usize];
};
pub const GB_cheat_search_data_type_t_GB_CHEAT_SEARCH_DATA_TYPE_8BIT: GB_cheat_search_data_type_t =
    0;
pub const GB_cheat_search_data_type_t_GB_CHEAT_SEARCH_DATA_TYPE_16BIT: GB_cheat_search_data_type_t =
    1;
pub const GB_cheat_search_data_type_t_GB_CHEAT_SEARCH_DATA_TYPE_BE_BIT:
    GB_cheat_search_data_type_t = 2;
pub const GB_cheat_search_data_type_t_GB_CHEAT_SEARCH_DATA_TYPE_16BIT_BE:
    GB_cheat_search_data_type_t = 3;
pub type GB_cheat_search_data_type_t = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn GB_cheat_search_reset(gb: *mut GB_gameboy_t);
}
unsafe extern "C" {
    pub fn GB_cheat_search_filter(
        gb: *mut GB_gameboy_t,
        expression: *const ::core::ffi::c_char,
        data_type: GB_cheat_search_data_type_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn GB_cheat_search_result_count(gb: *mut GB_gameboy_t) -> usize;
}
unsafe extern "C" {
    pub fn GB_cheat_search_get_results(
        gb: *mut GB_gameboy_t,
        results: *mut GB_cheat_search_result_t,
    );
}
pub const GB_rumble_mode_t_GB_RUMBLE_DISABLED: GB_rumble_mode_t = 0;
pub const GB_rumble_mode_t_GB_RUMBLE_CARTRIDGE_ONLY: GB_rumble_mode_t = 1;
pub const GB_rumble_mode_t_GB_RUMBLE_ALL_GAMES: GB_rumble_mode_t = 2;
pub type GB_rumble_mode_t = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn GB_set_rumble_mode(gb: *mut GB_gameboy_t, mode: GB_rumble_mode_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_workboy_t {
    pub byte_to_send: u8,
    pub bit_to_send: bool,
    pub byte_being_received: u8,
    pub bits_received: u8,
    pub mode: u8,
    pub key: u8,
    pub shift_down: bool,
    pub user_shift_down: bool,
    pub buffer: [u8; 21usize],
    pub buffer_index: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_workboy_t"][::core::mem::size_of::<GB_workboy_t>() - 30usize];
    ["Alignment of GB_workboy_t"][::core::mem::align_of::<GB_workboy_t>() - 1usize];
    ["Offset of field: GB_workboy_t::byte_to_send"]
        [::core::mem::offset_of!(GB_workboy_t, byte_to_send) - 0usize];
    ["Offset of field: GB_workboy_t::bit_to_send"]
        [::core::mem::offset_of!(GB_workboy_t, bit_to_send) - 1usize];
    ["Offset of field: GB_workboy_t::byte_being_received"]
        [::core::mem::offset_of!(GB_workboy_t, byte_being_received) - 2usize];
    ["Offset of field: GB_workboy_t::bits_received"]
        [::core::mem::offset_of!(GB_workboy_t, bits_received) - 3usize];
    ["Offset of field: GB_workboy_t::mode"][::core::mem::offset_of!(GB_workboy_t, mode) - 4usize];
    ["Offset of field: GB_workboy_t::key"][::core::mem::offset_of!(GB_workboy_t, key) - 5usize];
    ["Offset of field: GB_workboy_t::shift_down"]
        [::core::mem::offset_of!(GB_workboy_t, shift_down) - 6usize];
    ["Offset of field: GB_workboy_t::user_shift_down"]
        [::core::mem::offset_of!(GB_workboy_t, user_shift_down) - 7usize];
    ["Offset of field: GB_workboy_t::buffer"]
        [::core::mem::offset_of!(GB_workboy_t, buffer) - 8usize];
    ["Offset of field: GB_workboy_t::buffer_index"]
        [::core::mem::offset_of!(GB_workboy_t, buffer_index) - 29usize];
};
pub type GB_workboy_set_time_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, time: time_t)>;
pub type GB_workboy_get_time_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t) -> time_t>;
unsafe extern "C" {
    pub fn GB_connect_workboy(
        gb: *mut GB_gameboy_t,
        set_time_callback: GB_workboy_set_time_callback_t,
        get_time_callback: GB_workboy_get_time_callback_t,
    );
}
unsafe extern "C" {
    pub fn GB_workboy_is_enabled(gb: *mut GB_gameboy_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_workboy_set_key(gb: *mut GB_gameboy_t, key: u8);
}
unsafe extern "C" {
    pub fn GB_random_seed(seed: u64);
}
unsafe extern "C" {
    pub fn GB_random_set_enabled(enable: bool);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union GB_rtc_time_t {
    pub __bindgen_anon_1: GB_rtc_time_t__bindgen_ty_1,
    pub tpp1: GB_rtc_time_t__bindgen_ty_2,
    pub data: [u8; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_rtc_time_t__bindgen_ty_1 {
    pub seconds: u8,
    pub minutes: u8,
    pub hours: u8,
    pub days: u8,
    pub high: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_rtc_time_t__bindgen_ty_1"]
        [::core::mem::size_of::<GB_rtc_time_t__bindgen_ty_1>() - 5usize];
    ["Alignment of GB_rtc_time_t__bindgen_ty_1"]
        [::core::mem::align_of::<GB_rtc_time_t__bindgen_ty_1>() - 1usize];
    ["Offset of field: GB_rtc_time_t__bindgen_ty_1::seconds"]
        [::core::mem::offset_of!(GB_rtc_time_t__bindgen_ty_1, seconds) - 0usize];
    ["Offset of field: GB_rtc_time_t__bindgen_ty_1::minutes"]
        [::core::mem::offset_of!(GB_rtc_time_t__bindgen_ty_1, minutes) - 1usize];
    ["Offset of field: GB_rtc_time_t__bindgen_ty_1::hours"]
        [::core::mem::offset_of!(GB_rtc_time_t__bindgen_ty_1, hours) - 2usize];
    ["Offset of field: GB_rtc_time_t__bindgen_ty_1::days"]
        [::core::mem::offset_of!(GB_rtc_time_t__bindgen_ty_1, days) - 3usize];
    ["Offset of field: GB_rtc_time_t__bindgen_ty_1::high"]
        [::core::mem::offset_of!(GB_rtc_time_t__bindgen_ty_1, high) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_rtc_time_t__bindgen_ty_2 {
    pub seconds: u8,
    pub minutes: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub weeks: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_rtc_time_t__bindgen_ty_2"]
        [::core::mem::size_of::<GB_rtc_time_t__bindgen_ty_2>() - 4usize];
    ["Alignment of GB_rtc_time_t__bindgen_ty_2"]
        [::core::mem::align_of::<GB_rtc_time_t__bindgen_ty_2>() - 1usize];
    ["Offset of field: GB_rtc_time_t__bindgen_ty_2::seconds"]
        [::core::mem::offset_of!(GB_rtc_time_t__bindgen_ty_2, seconds) - 0usize];
    ["Offset of field: GB_rtc_time_t__bindgen_ty_2::minutes"]
        [::core::mem::offset_of!(GB_rtc_time_t__bindgen_ty_2, minutes) - 1usize];
    ["Offset of field: GB_rtc_time_t__bindgen_ty_2::weeks"]
        [::core::mem::offset_of!(GB_rtc_time_t__bindgen_ty_2, weeks) - 3usize];
};
impl GB_rtc_time_t__bindgen_ty_2 {
    #[inline]
    pub fn hours(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_hours(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hours_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                5u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hours_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn weekday(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_weekday(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn weekday_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                3u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_weekday_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(hours: u8, weekday: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let hours: u8 = unsafe { ::core::mem::transmute(hours) };
            hours as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let weekday: u8 = unsafe { ::core::mem::transmute(weekday) };
            weekday as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_rtc_time_t"][::core::mem::size_of::<GB_rtc_time_t>() - 5usize];
    ["Alignment of GB_rtc_time_t"][::core::mem::align_of::<GB_rtc_time_t>() - 1usize];
    ["Offset of field: GB_rtc_time_t::tpp1"][::core::mem::offset_of!(GB_rtc_time_t, tpp1) - 0usize];
    ["Offset of field: GB_rtc_time_t::data"][::core::mem::offset_of!(GB_rtc_time_t, data) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GB_huc3_rtc_time_t {
    pub last_rtc_second: u64,
    pub minutes: u16,
    pub days: u16,
    pub alarm_minutes: u16,
    pub alarm_days: u16,
    pub alarm_enabled: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_huc3_rtc_time_t"][::core::mem::size_of::<GB_huc3_rtc_time_t>() - 17usize];
    ["Alignment of GB_huc3_rtc_time_t"][::core::mem::align_of::<GB_huc3_rtc_time_t>() - 1usize];
    ["Offset of field: GB_huc3_rtc_time_t::last_rtc_second"]
        [::core::mem::offset_of!(GB_huc3_rtc_time_t, last_rtc_second) - 0usize];
    ["Offset of field: GB_huc3_rtc_time_t::minutes"]
        [::core::mem::offset_of!(GB_huc3_rtc_time_t, minutes) - 8usize];
    ["Offset of field: GB_huc3_rtc_time_t::days"]
        [::core::mem::offset_of!(GB_huc3_rtc_time_t, days) - 10usize];
    ["Offset of field: GB_huc3_rtc_time_t::alarm_minutes"]
        [::core::mem::offset_of!(GB_huc3_rtc_time_t, alarm_minutes) - 12usize];
    ["Offset of field: GB_huc3_rtc_time_t::alarm_days"]
        [::core::mem::offset_of!(GB_huc3_rtc_time_t, alarm_days) - 14usize];
    ["Offset of field: GB_huc3_rtc_time_t::alarm_enabled"]
        [::core::mem::offset_of!(GB_huc3_rtc_time_t, alarm_enabled) - 16usize];
};
pub const GB_border_mode_t_GB_BORDER_SGB: GB_border_mode_t = 0;
pub const GB_border_mode_t_GB_BORDER_NEVER: GB_border_mode_t = 1;
pub const GB_border_mode_t_GB_BORDER_ALWAYS: GB_border_mode_t = 2;
pub type GB_border_mode_t = ::core::ffi::c_uint;
pub const GB_log_attributes_t_GB_LOG_BOLD: GB_log_attributes_t = 1;
pub const GB_log_attributes_t_GB_LOG_DASHED_UNDERLINE: GB_log_attributes_t = 2;
pub const GB_log_attributes_t_GB_LOG_UNDERLINE: GB_log_attributes_t = 4;
pub const GB_log_attributes_t_GB_LOG_UNDERLINE_MASK: GB_log_attributes_t = 6;
pub type GB_log_attributes_t = ::core::ffi::c_uint;
pub const GB_boot_rom_t_GB_BOOT_ROM_DMG_0: GB_boot_rom_t = 0;
pub const GB_boot_rom_t_GB_BOOT_ROM_DMG: GB_boot_rom_t = 1;
pub const GB_boot_rom_t_GB_BOOT_ROM_MGB: GB_boot_rom_t = 2;
pub const GB_boot_rom_t_GB_BOOT_ROM_SGB: GB_boot_rom_t = 3;
pub const GB_boot_rom_t_GB_BOOT_ROM_SGB2: GB_boot_rom_t = 4;
pub const GB_boot_rom_t_GB_BOOT_ROM_CGB_0: GB_boot_rom_t = 5;
pub const GB_boot_rom_t_GB_BOOT_ROM_CGB: GB_boot_rom_t = 6;
pub const GB_boot_rom_t_GB_BOOT_ROM_CGB_E: GB_boot_rom_t = 7;
pub const GB_boot_rom_t_GB_BOOT_ROM_AGB_0: GB_boot_rom_t = 8;
pub const GB_boot_rom_t_GB_BOOT_ROM_AGB: GB_boot_rom_t = 9;
pub type GB_boot_rom_t = ::core::ffi::c_uint;
pub type GB_log_callback_t = ::core::option::Option<
    unsafe extern "C" fn(
        gb: *mut GB_gameboy_t,
        string: *const ::core::ffi::c_char,
        attributes: GB_log_attributes_t,
    ),
>;
pub type GB_input_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t) -> *mut ::core::ffi::c_char>;
pub type GB_infrared_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, on: bool)>;
pub type GB_rumble_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, rumble_amplitude: f64)>;
pub type GB_serial_transfer_bit_start_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, bit_to_send: bool)>;
pub type GB_serial_transfer_bit_end_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t) -> bool>;
pub type GB_joyp_write_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, value: u8)>;
pub type GB_icd_pixel_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, row: u8)>;
pub type GB_icd_hreset_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t)>;
pub type GB_icd_vreset_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t)>;
pub type GB_boot_rom_load_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, type_: GB_boot_rom_t)>;
pub type GB_execution_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, address: u16, opcode: u8)>;
pub type GB_lcd_line_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, line: u8)>;
pub type GB_lcd_status_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gb: *mut GB_gameboy_t, on: bool)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_breakpoint_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_watchpoint_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gbs_header_t {
    pub magic: u32,
    pub track_count: u8,
    pub first_track: u8,
    pub load_address: u16,
    pub init_address: u16,
    pub play_address: u16,
    pub sp: u16,
    pub TMA: u8,
    pub TAC: u8,
    pub title: [::core::ffi::c_char; 32usize],
    pub author: [::core::ffi::c_char; 32usize],
    pub copyright: [::core::ffi::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gbs_header_t"][::core::mem::size_of::<GB_gbs_header_t>() - 112usize];
    ["Alignment of GB_gbs_header_t"][::core::mem::align_of::<GB_gbs_header_t>() - 4usize];
    ["Offset of field: GB_gbs_header_t::magic"]
        [::core::mem::offset_of!(GB_gbs_header_t, magic) - 0usize];
    ["Offset of field: GB_gbs_header_t::track_count"]
        [::core::mem::offset_of!(GB_gbs_header_t, track_count) - 4usize];
    ["Offset of field: GB_gbs_header_t::first_track"]
        [::core::mem::offset_of!(GB_gbs_header_t, first_track) - 5usize];
    ["Offset of field: GB_gbs_header_t::load_address"]
        [::core::mem::offset_of!(GB_gbs_header_t, load_address) - 6usize];
    ["Offset of field: GB_gbs_header_t::init_address"]
        [::core::mem::offset_of!(GB_gbs_header_t, init_address) - 8usize];
    ["Offset of field: GB_gbs_header_t::play_address"]
        [::core::mem::offset_of!(GB_gbs_header_t, play_address) - 10usize];
    ["Offset of field: GB_gbs_header_t::sp"]
        [::core::mem::offset_of!(GB_gbs_header_t, sp) - 12usize];
    ["Offset of field: GB_gbs_header_t::TMA"]
        [::core::mem::offset_of!(GB_gbs_header_t, TMA) - 14usize];
    ["Offset of field: GB_gbs_header_t::TAC"]
        [::core::mem::offset_of!(GB_gbs_header_t, TAC) - 15usize];
    ["Offset of field: GB_gbs_header_t::title"]
        [::core::mem::offset_of!(GB_gbs_header_t, title) - 16usize];
    ["Offset of field: GB_gbs_header_t::author"]
        [::core::mem::offset_of!(GB_gbs_header_t, author) - 48usize];
    ["Offset of field: GB_gbs_header_t::copyright"]
        [::core::mem::offset_of!(GB_gbs_header_t, copyright) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gbs_info_t {
    pub track_count: u8,
    pub first_track: u8,
    pub title: [::core::ffi::c_char; 33usize],
    pub author: [::core::ffi::c_char; 33usize],
    pub copyright: [::core::ffi::c_char; 33usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gbs_info_t"][::core::mem::size_of::<GB_gbs_info_t>() - 101usize];
    ["Alignment of GB_gbs_info_t"][::core::mem::align_of::<GB_gbs_info_t>() - 1usize];
    ["Offset of field: GB_gbs_info_t::track_count"]
        [::core::mem::offset_of!(GB_gbs_info_t, track_count) - 0usize];
    ["Offset of field: GB_gbs_info_t::first_track"]
        [::core::mem::offset_of!(GB_gbs_info_t, first_track) - 1usize];
    ["Offset of field: GB_gbs_info_t::title"]
        [::core::mem::offset_of!(GB_gbs_info_t, title) - 2usize];
    ["Offset of field: GB_gbs_info_t::author"]
        [::core::mem::offset_of!(GB_gbs_info_t, author) - 35usize];
    ["Offset of field: GB_gbs_info_t::copyright"]
        [::core::mem::offset_of!(GB_gbs_info_t, copyright) - 68usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union GB_registers_t {
    pub registers: [u16; 6usize],
    pub __bindgen_anon_1: GB_registers_t__bindgen_ty_1,
    pub __bindgen_anon_2: GB_registers_t__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_registers_t__bindgen_ty_1 {
    pub af: u16,
    pub bc: u16,
    pub de: u16,
    pub hl: u16,
    pub sp: u16,
    pub pc: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_registers_t__bindgen_ty_1"]
        [::core::mem::size_of::<GB_registers_t__bindgen_ty_1>() - 12usize];
    ["Alignment of GB_registers_t__bindgen_ty_1"]
        [::core::mem::align_of::<GB_registers_t__bindgen_ty_1>() - 2usize];
    ["Offset of field: GB_registers_t__bindgen_ty_1::af"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_1, af) - 0usize];
    ["Offset of field: GB_registers_t__bindgen_ty_1::bc"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_1, bc) - 2usize];
    ["Offset of field: GB_registers_t__bindgen_ty_1::de"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_1, de) - 4usize];
    ["Offset of field: GB_registers_t__bindgen_ty_1::hl"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_1, hl) - 6usize];
    ["Offset of field: GB_registers_t__bindgen_ty_1::sp"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_1, sp) - 8usize];
    ["Offset of field: GB_registers_t__bindgen_ty_1::pc"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_1, pc) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_registers_t__bindgen_ty_2 {
    pub f: u8,
    pub a: u8,
    pub c: u8,
    pub b: u8,
    pub e: u8,
    pub d: u8,
    pub l: u8,
    pub h: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_registers_t__bindgen_ty_2"]
        [::core::mem::size_of::<GB_registers_t__bindgen_ty_2>() - 8usize];
    ["Alignment of GB_registers_t__bindgen_ty_2"]
        [::core::mem::align_of::<GB_registers_t__bindgen_ty_2>() - 1usize];
    ["Offset of field: GB_registers_t__bindgen_ty_2::f"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_2, f) - 0usize];
    ["Offset of field: GB_registers_t__bindgen_ty_2::a"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_2, a) - 1usize];
    ["Offset of field: GB_registers_t__bindgen_ty_2::c"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_2, c) - 2usize];
    ["Offset of field: GB_registers_t__bindgen_ty_2::b"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_2, b) - 3usize];
    ["Offset of field: GB_registers_t__bindgen_ty_2::e"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_2, e) - 4usize];
    ["Offset of field: GB_registers_t__bindgen_ty_2::d"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_2, d) - 5usize];
    ["Offset of field: GB_registers_t__bindgen_ty_2::l"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_2, l) - 6usize];
    ["Offset of field: GB_registers_t__bindgen_ty_2::h"]
        [::core::mem::offset_of!(GB_registers_t__bindgen_ty_2, h) - 7usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_registers_t"][::core::mem::size_of::<GB_registers_t>() - 12usize];
    ["Alignment of GB_registers_t"][::core::mem::align_of::<GB_registers_t>() - 2usize];
    ["Offset of field: GB_registers_t::registers"]
        [::core::mem::offset_of!(GB_registers_t, registers) - 0usize];
};
pub const GB_accessory_t_GB_ACCESSORY_NONE: GB_accessory_t = 0;
pub const GB_accessory_t_GB_ACCESSORY_PRINTER: GB_accessory_t = 1;
pub const GB_accessory_t_GB_ACCESSORY_WORKBOY: GB_accessory_t = 2;
pub type GB_accessory_t = u8;
#[repr(C)]
pub struct GB_gameboy_internal_s {
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_1,
    pub header_section_end: __IncompleteArrayField<u8>,
    pub __bindgen_anon_2: GB_gameboy_internal_s__bindgen_ty_2,
    pub core_state_section_end: __IncompleteArrayField<u8>,
    pub __bindgen_anon_3: GB_gameboy_internal_s__bindgen_ty_3,
    pub dma_section_end: __IncompleteArrayField<u8>,
    pub __bindgen_anon_4: GB_gameboy_internal_s__bindgen_ty_4,
    pub mbc_section_end: __IncompleteArrayField<u8>,
    pub __bindgen_anon_5: GB_gameboy_internal_s__bindgen_ty_5,
    pub hram_section_end: __IncompleteArrayField<u8>,
    pub __bindgen_anon_6: GB_gameboy_internal_s__bindgen_ty_6,
    pub timing_section_end: __IncompleteArrayField<u8>,
    pub __bindgen_anon_7: GB_gameboy_internal_s__bindgen_ty_7,
    pub apu_section_end: __IncompleteArrayField<u8>,
    pub __bindgen_anon_8: GB_gameboy_internal_s__bindgen_ty_8,
    pub rtc_section_end: __IncompleteArrayField<u8>,
    pub __bindgen_anon_9: GB_gameboy_internal_s__bindgen_ty_9,
    pub video_section_end: __IncompleteArrayField<u8>,
    pub __bindgen_anon_10: GB_gameboy_internal_s__bindgen_ty_10,
    pub accessory_section_end: __IncompleteArrayField<u8>,
    pub __bindgen_anon_11: GB_gameboy_internal_s__bindgen_ty_11,
    pub unsaved_section_end: __IncompleteArrayField<u8>,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_1 {
    pub header_section_start: u8,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_1__bindgen_ty_1 {
    pub magic: u32,
    pub version: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_1__bindgen_ty_1::magic"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_1__bindgen_ty_1,
        magic
    ) - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_1__bindgen_ty_1::version"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_1__bindgen_ty_1,
        version
    ) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_1>() - 8usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_1>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_1::header_section_start"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_1,
        header_section_start
    ) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_2 {
    pub core_state_section_start: u8,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1 {
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1,
    pub ime: u8,
    pub interrupt_enable: u8,
    pub cgb_ram_bank: u8,
    pub model: GB_model_t,
    pub cgb_mode: bool,
    pub cgb_double_speed: bool,
    pub halted: bool,
    pub stopped: bool,
    pub boot_rom_finished: bool,
    pub ime_toggle: bool,
    pub halt_bug: bool,
    pub just_halted: bool,
    pub infrared_input: bool,
    pub extra_oam: [u8; 96usize],
    pub ram_size: u32,
    pub ir_sensor: i32,
    pub effective_ir_input: bool,
    pub address_bus: u16,
    pub data_bus: u8,
    pub data_bus_decay_countdown: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1 {
    pub registers: [u16; 6usize],
    pub __bindgen_anon_1:
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2:
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub af: u16,
    pub bc: u16,
    pub de: u16,
    pub hl: u16,
    pub sp: u16,
    pub pc: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<
            GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        >() - 12usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<
            GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        >() - 2usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::af",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        af
    ) - 0usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::bc",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        bc
    ) - 2usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::de",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        de
    ) - 4usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::hl",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        hl
    ) - 6usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::sp",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        sp
    ) - 8usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::pc",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        pc
    ) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 {
    pub f: u8,
    pub a: u8,
    pub c: u8,
    pub b: u8,
    pub e: u8,
    pub d: u8,
    pub l: u8,
    pub h: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<
            GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        >() - 8usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<
            GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        >() - 1usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::f",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        f
    ) - 0usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::a",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        a
    ) - 1usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::c",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        c
    ) - 2usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::b",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        b
    ) - 3usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::e",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        e
    ) - 4usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::d",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        d
    ) - 5usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::l",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        l
    ) - 6usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::h",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        h
    ) - 7usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1"][::core::mem::size_of::<
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1,
    >() - 12usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1>(
        ) - 2usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1::registers"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1,
            registers
        ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1>() - 148usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1>() - 4usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::ime"]
        [::core::mem::offset_of!(GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1, ime) - 12usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::interrupt_enable"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        interrupt_enable
    )
        - 13usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::cgb_ram_bank"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        cgb_ram_bank
    )
        - 14usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::model"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        model
    ) - 16usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::cgb_mode"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        cgb_mode
    ) - 20usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::cgb_double_speed"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        cgb_double_speed
    )
        - 21usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::halted"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        halted
    ) - 22usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::stopped"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        stopped
    ) - 23usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::boot_rom_finished"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        boot_rom_finished
    )
        - 24usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::ime_toggle"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        ime_toggle
    ) - 25usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::halt_bug"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        halt_bug
    ) - 26usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::just_halted"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        just_halted
    )
        - 27usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::infrared_input"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        infrared_input
    )
        - 28usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::extra_oam"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        extra_oam
    ) - 29usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::ram_size"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        ram_size
    ) - 128usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::ir_sensor"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        ir_sensor
    ) - 132usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::effective_ir_input"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        effective_ir_input
    )
        - 136usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::address_bus"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        address_bus
    )
        - 138usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::data_bus"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        data_bus
    ) - 140usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1::data_bus_decay_countdown",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2__bindgen_ty_1,
        data_bus_decay_countdown
    ) - 144usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_2"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_2>() - 152usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_2"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_2>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_2::core_state_section_start"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_2,
        core_state_section_start
    ) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_3 {
    pub dma_section_start: u8,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1 {
    pub hdma_on: bool,
    pub hdma_on_hblank: bool,
    pub hdma_steps_left: u8,
    pub hdma_current_src: u16,
    pub hdma_current_dest: u16,
    pub dma_current_dest: u8,
    pub last_dma_read: u8,
    pub dma_current_src: u16,
    pub dma_cycles: u16,
    pub dma_cycles_modulo: i8,
    pub dma_ppu_vram_conflict: bool,
    pub dma_ppu_vram_conflict_addr: u16,
    pub allow_hdma_on_wake: bool,
    pub dma_restarting: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1>() - 20usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1>() - 2usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::hdma_on"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        hdma_on
    ) - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::hdma_on_hblank"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        hdma_on_hblank
    )
        - 1usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::hdma_steps_left"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        hdma_steps_left
    )
        - 2usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::hdma_current_src"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        hdma_current_src
    )
        - 4usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::hdma_current_dest"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        hdma_current_dest
    )
        - 6usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::dma_current_dest"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        dma_current_dest
    )
        - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::last_dma_read"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        last_dma_read
    )
        - 9usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::dma_current_src"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        dma_current_src
    )
        - 10usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::dma_cycles"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        dma_cycles
    ) - 12usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::dma_cycles_modulo"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        dma_cycles_modulo
    )
        - 14usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::dma_ppu_vram_conflict"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        dma_ppu_vram_conflict
    )
        - 15usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::dma_ppu_vram_conflict_addr",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        dma_ppu_vram_conflict_addr
    ) - 16usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::allow_hdma_on_wake"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        allow_hdma_on_wake
    )
        - 18usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1::dma_restarting"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_3__bindgen_ty_1,
        dma_restarting
    )
        - 19usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_3"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_3>() - 24usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_3"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_3>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_3::dma_section_start"]
        [::core::mem::offset_of!(GB_gameboy_internal_s__bindgen_ty_3, dma_section_start) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_4 {
    pub mbc_section_start: u8,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1 {
    pub mbc_rom_bank: u16,
    pub mbc_rom0_bank: u16,
    pub mbc_ram_bank: u8,
    pub mbc_ram_size: u32,
    pub mbc_ram_enable: bool,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
    pub rumble_strength: u8,
    pub cart_ir: bool,
    pub camera_registers_mapped: bool,
    pub camera_registers: [u8; 54usize],
    pub camera_alignment: u8,
    pub camera_countdown: i32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 {
    pub mbc1: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub mbc2: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
    pub mbc3: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_3,
    pub mbc5: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_4,
    pub mbc7: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5,
    pub mmm01: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_6,
    pub huc1: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_7,
    pub huc3: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8,
    pub tpp1: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_9,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        >() - 1usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        >() - 1usize];
};
impl GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn bank_low(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_bank_low(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bank_low_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                5u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_bank_low_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn bank_high(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_bank_high(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bank_high_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_bank_high_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mode_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_mode_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bank_low: u8,
        bank_high: u8,
        mode: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let bank_low: u8 = unsafe { ::core::mem::transmute(bank_low) };
            bank_low as u64
        });
        __bindgen_bitfield_unit.set(5usize, 2u8, {
            let bank_high: u8 = unsafe { ::core::mem::transmute(bank_high) };
            bank_high as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let mode: u8 = unsafe { ::core::mem::transmute(mode) };
            mode as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        >() - 1usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        >() - 1usize];
};
impl GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 {
    #[inline]
    pub fn rom_bank(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_rom_bank(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rom_bank_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rom_bank_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(rom_bank: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let rom_bank: u8 = unsafe { ::core::mem::transmute(rom_bank) };
            rom_bank as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_3 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::size_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_3,
        >() - 2usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::align_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_3,
        >() - 1usize];
};
impl GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_3 {
    #[inline]
    pub fn rom_bank(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u8) }
    }
    #[inline]
    pub fn set_rom_bank(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rom_bank_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rom_bank_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ram_bank(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_ram_bank(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ram_bank_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                3u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ram_bank_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rtc_mapped(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rtc_mapped(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rtc_mapped_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rtc_mapped_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        rom_bank: u8,
        ram_bank: u8,
        rtc_mapped: bool,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let rom_bank: u8 = unsafe { ::core::mem::transmute(rom_bank) };
            rom_bank as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let ram_bank: u8 = unsafe { ::core::mem::transmute(ram_bank) };
            ram_bank as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let rtc_mapped: u8 = unsafe { ::core::mem::transmute(rtc_mapped) };
            rtc_mapped as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_4 {
    pub rom_bank_low: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::size_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_4,
        >() - 2usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::align_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_4,
        >() - 1usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_4::rom_bank_low",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_4,
        rom_bank_low
    ) - 0usize];
};
impl GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_4 {
    #[inline]
    pub fn rom_bank_high(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rom_bank_high(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rom_bank_high_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rom_bank_high_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ram_bank(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_ram_bank(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ram_bank_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ram_bank_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(rom_bank_high: u8, ram_bank: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let rom_bank_high: u8 = unsafe { ::core::mem::transmute(rom_bank_high) };
            rom_bank_high as u64
        });
        __bindgen_bitfield_unit.set(1usize, 4u8, {
            let ram_bank: u8 = unsafe { ::core::mem::transmute(ram_bank) };
            ram_bank as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5 {
    pub x_latch: u16,
    pub y_latch: u16,
    pub rom_bank: u8,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub read_bits: u16,
    pub _bitfield_align_2: [u8; 0],
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5"]
        [::core::mem::size_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5,
        >() - 12usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5"]
        [::core::mem::align_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5,
        >() - 2usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5::x_latch",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5,
        x_latch
    ) - 0usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5::y_latch",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5,
        y_latch
    ) - 2usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5::rom_bank",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5,
        rom_bank
    ) - 4usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5::read_bits",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5,
        read_bits
    ) - 8usize];
};
impl GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_5 {
    #[inline]
    pub fn latch_ready(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_latch_ready(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn latch_ready_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_latch_ready_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn eeprom_do(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_eeprom_do(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn eeprom_do_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_eeprom_do_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn eeprom_di(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_eeprom_di(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn eeprom_di_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_eeprom_di_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn eeprom_clk(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_eeprom_clk(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn eeprom_clk_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_eeprom_clk_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn eeprom_cs(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_eeprom_cs(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn eeprom_cs_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_eeprom_cs_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn eeprom_command(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 11u8) as u16) }
    }
    #[inline]
    pub fn set_eeprom_command(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 11u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn eeprom_command_raw(this: *const Self) -> u16 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                11u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_eeprom_command_raw(this: *mut Self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                11u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        latch_ready: bool,
        eeprom_do: bool,
        eeprom_di: bool,
        eeprom_clk: bool,
        eeprom_cs: bool,
        eeprom_command: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let latch_ready: u8 = unsafe { ::core::mem::transmute(latch_ready) };
            latch_ready as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let eeprom_do: u8 = unsafe { ::core::mem::transmute(eeprom_do) };
            eeprom_do as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let eeprom_di: u8 = unsafe { ::core::mem::transmute(eeprom_di) };
            eeprom_di as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let eeprom_clk: u8 = unsafe { ::core::mem::transmute(eeprom_clk) };
            eeprom_clk as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let eeprom_cs: u8 = unsafe { ::core::mem::transmute(eeprom_cs) };
            eeprom_cs as u64
        });
        __bindgen_bitfield_unit.set(5usize, 11u8, {
            let eeprom_command: u16 = unsafe { ::core::mem::transmute(eeprom_command) };
            eeprom_command as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn argument_bits_left(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_2.get(0usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_argument_bits_left(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_2.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn argument_bits_left_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_2),
                0usize,
                5u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_argument_bits_left_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_2),
                0usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn secondary_ram_enable(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_2.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_secondary_ram_enable(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_2.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn secondary_ram_enable_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_2),
                5usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_secondary_ram_enable_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_2),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn eeprom_write_enabled(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_2.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_eeprom_write_enabled(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_2.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn eeprom_write_enabled_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_2),
                6usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_eeprom_write_enabled_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_2),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_2(
        argument_bits_left: u8,
        secondary_ram_enable: bool,
        eeprom_write_enabled: bool,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let argument_bits_left: u8 = unsafe { ::core::mem::transmute(argument_bits_left) };
            argument_bits_left as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let secondary_ram_enable: u8 = unsafe { ::core::mem::transmute(secondary_ram_enable) };
            secondary_ram_enable as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let eeprom_write_enabled: u8 = unsafe { ::core::mem::transmute(eeprom_write_enabled) };
            eeprom_write_enabled as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_6 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_6"]
        [::core::mem::size_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_6,
        >() - 3usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_6"]
        [::core::mem::align_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_6,
        >() - 1usize];
};
impl GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_6 {
    #[inline]
    pub fn rom_bank_low(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_rom_bank_low(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rom_bank_low_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                5u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rom_bank_low_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rom_bank_mid(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_rom_bank_mid(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rom_bank_mid_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rom_bank_mid_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mbc1_mode(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mbc1_mode(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mbc1_mode_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_mbc1_mode_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rom_bank_mask(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_rom_bank_mask(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rom_bank_mask_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rom_bank_mask_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rom_bank_high(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_rom_bank_high(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rom_bank_high_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rom_bank_high_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ram_bank_low(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_ram_bank_low(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ram_bank_low_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ram_bank_low_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ram_bank_high(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_ram_bank_high(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ram_bank_high_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ram_bank_high_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ram_bank_mask(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_ram_bank_mask(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ram_bank_mask_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                18usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ram_bank_mask_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                18usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn locked(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_locked(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn locked_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_locked_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mbc1_mode_disable(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mbc1_mode_disable(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mbc1_mode_disable_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                21usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_mbc1_mode_disable_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                21usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn multiplex_mode(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_multiplex_mode(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn multiplex_mode_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                22usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_multiplex_mode_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                22usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        rom_bank_low: u8,
        rom_bank_mid: u8,
        mbc1_mode: bool,
        rom_bank_mask: u8,
        rom_bank_high: u8,
        ram_bank_low: u8,
        ram_bank_high: u8,
        ram_bank_mask: u8,
        locked: bool,
        mbc1_mode_disable: bool,
        multiplex_mode: bool,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let rom_bank_low: u8 = unsafe { ::core::mem::transmute(rom_bank_low) };
            rom_bank_low as u64
        });
        __bindgen_bitfield_unit.set(5usize, 2u8, {
            let rom_bank_mid: u8 = unsafe { ::core::mem::transmute(rom_bank_mid) };
            rom_bank_mid as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let mbc1_mode: u8 = unsafe { ::core::mem::transmute(mbc1_mode) };
            mbc1_mode as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let rom_bank_mask: u8 = unsafe { ::core::mem::transmute(rom_bank_mask) };
            rom_bank_mask as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let rom_bank_high: u8 = unsafe { ::core::mem::transmute(rom_bank_high) };
            rom_bank_high as u64
        });
        __bindgen_bitfield_unit.set(14usize, 2u8, {
            let ram_bank_low: u8 = unsafe { ::core::mem::transmute(ram_bank_low) };
            ram_bank_low as u64
        });
        __bindgen_bitfield_unit.set(16usize, 2u8, {
            let ram_bank_high: u8 = unsafe { ::core::mem::transmute(ram_bank_high) };
            ram_bank_high as u64
        });
        __bindgen_bitfield_unit.set(18usize, 2u8, {
            let ram_bank_mask: u8 = unsafe { ::core::mem::transmute(ram_bank_mask) };
            ram_bank_mask as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let locked: u8 = unsafe { ::core::mem::transmute(locked) };
            locked as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let mbc1_mode_disable: u8 = unsafe { ::core::mem::transmute(mbc1_mode_disable) };
            mbc1_mode_disable as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let multiplex_mode: u8 = unsafe { ::core::mem::transmute(multiplex_mode) };
            multiplex_mode as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_7 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_7"]
        [::core::mem::size_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_7,
        >() - 2usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_7"]
        [::core::mem::align_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_7,
        >() - 1usize];
};
impl GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_7 {
    #[inline]
    pub fn bank_low(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_bank_low(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bank_low_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                6u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_bank_low_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                6u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn bank_high(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_bank_high(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bank_high_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                3u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_bank_high_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ir_mode(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ir_mode(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ir_mode_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ir_mode_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bank_low: u8,
        bank_high: u8,
        ir_mode: bool,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 6u8, {
            let bank_low: u8 = unsafe { ::core::mem::transmute(bank_low) };
            bank_low as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let bank_high: u8 = unsafe { ::core::mem::transmute(bank_high) };
            bank_high as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let ir_mode: u8 = unsafe { ::core::mem::transmute(ir_mode) };
            ir_mode as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub minutes: u16,
    pub days: u16,
    pub alarm_minutes: u16,
    pub alarm_days: u16,
    pub access_index: u8,
    pub alarm_enabled: bool,
    pub read: u8,
    pub access_flags: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8"]
        [::core::mem::size_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8,
        >() - 14usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8"]
        [::core::mem::align_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8,
        >() - 2usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8::minutes",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8,
        minutes
    ) - 2usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8::days",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8,
        days
    ) - 4usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8::alarm_minutes",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8,
        alarm_minutes
    ) - 6usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8::alarm_days",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8,
        alarm_days
    ) - 8usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8::access_index",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8,
        access_index
    ) - 10usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8::alarm_enabled",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8,
        alarm_enabled
    ) - 11usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8::read",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8,
        read
    ) - 12usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8::access_flags",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8,
        access_flags
    ) - 13usize];
};
impl GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_8 {
    #[inline]
    pub fn rom_bank(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_rom_bank(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rom_bank_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                7u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rom_bank_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn padding(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_padding(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn padding_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_padding_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ram_bank(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_ram_bank(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ram_bank_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ram_bank_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mode_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_mode_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        rom_bank: u8,
        padding: u8,
        ram_bank: u8,
        mode: u8,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 7u8, {
            let rom_bank: u8 = unsafe { ::core::mem::transmute(rom_bank) };
            rom_bank as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let padding: u8 = unsafe { ::core::mem::transmute(padding) };
            padding as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let ram_bank: u8 = unsafe { ::core::mem::transmute(ram_bank) };
            ram_bank as u64
        });
        __bindgen_bitfield_unit.set(12usize, 4u8, {
            let mode: u8 = unsafe { ::core::mem::transmute(mode) };
            mode as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_9 {
    pub rom_bank: u16,
    pub ram_bank: u8,
    pub mode: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_9"]
        [::core::mem::size_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_9,
        >() - 4usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_9"]
        [::core::mem::align_of::<
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_9,
        >() - 2usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_9::rom_bank",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_9,
        rom_bank
    ) - 0usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_9::ram_bank",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_9,
        ram_bank
    ) - 2usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_9::mode",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_9,
        mode
    ) - 3usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1"][::core::mem::size_of::<
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
    >() - 14usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1>(
        ) - 2usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::mbc1"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        mbc1
    )
        - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::mbc2"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        mbc2
    )
        - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::mbc3"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        mbc3
    )
        - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::mbc5"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        mbc5
    )
        - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::mbc7"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        mbc7
    )
        - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::mmm01"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        mmm01
    )
        - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::huc1"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        huc1
    )
        - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::huc3"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        huc3
    )
        - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::tpp1"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        tpp1
    )
        - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1>() - 92usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1>() - 4usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1::mbc_rom_bank"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1,
        mbc_rom_bank
    )
        - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1::mbc_rom0_bank"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1,
        mbc_rom0_bank
    )
        - 2usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1::mbc_ram_bank"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1,
        mbc_ram_bank
    )
        - 4usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1::mbc_ram_size"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1,
        mbc_ram_size
    )
        - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1::mbc_ram_enable"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1,
        mbc_ram_enable
    )
        - 12usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1::rumble_strength"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1,
        rumble_strength
    )
        - 28usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1::cart_ir"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1,
        cart_ir
    ) - 29usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1::camera_registers_mapped"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1,
            camera_registers_mapped
        ) - 30usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1::camera_registers"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1,
        camera_registers
    )
        - 31usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1::camera_alignment"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1,
        camera_alignment
    )
        - 85usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1::camera_countdown"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_4__bindgen_ty_1,
        camera_countdown
    )
        - 88usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_4"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_4>() - 96usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_4"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_4>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_4::mbc_section_start"]
        [::core::mem::offset_of!(GB_gameboy_internal_s__bindgen_ty_4, mbc_section_start) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_5 {
    pub hram_section_start: u8,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_5__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_5__bindgen_ty_1 {
    pub hram: [u8; 127usize],
    pub io_registers: [u8; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_5__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_5__bindgen_ty_1>() - 255usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_5__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_5__bindgen_ty_1>() - 1usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_5__bindgen_ty_1::hram"]
        [::core::mem::offset_of!(GB_gameboy_internal_s__bindgen_ty_5__bindgen_ty_1, hram) - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_5__bindgen_ty_1::io_registers"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_5__bindgen_ty_1,
        io_registers
    )
        - 127usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_5"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_5>() - 256usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_5"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_5>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_5::hram_section_start"]
        [::core::mem::offset_of!(GB_gameboy_internal_s__bindgen_ty_5, hram_section_start) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_6 {
    pub timing_section_start: u8,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1 {
    pub display_cycles: i32,
    pub display_state: i32,
    pub div_cycles: i32,
    pub div_state: i32,
    pub div_counter: u16,
    pub tima_reload_state: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1,
    pub serial_master_clock: bool,
    pub serial_mask: u8,
    pub double_speed_alignment: u8,
    pub serial_count: u8,
    pub speed_switch_halt_countdown: i32,
    pub speed_switch_countdown: u8,
    pub speed_switch_freeze: u8,
    pub cycles_since_vblank_callback: u32,
    pub lcd_disabled_outside_of_vblank: bool,
    pub allowed_pending_cycles: i32,
    pub mode3_batching_length: u16,
    pub joyp_switching_delay: u8,
    pub joyp_switch_value: u8,
    pub key_bounce_timing: [u16; 8usize],
}
pub const GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1_GB_TIMA_RUNNING:
    GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1 = 0;
pub const GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1_GB_TIMA_RELOADING:
    GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1 = 1;
pub const GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1_GB_TIMA_RELOADED:
    GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1 = 2;
pub type GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1 = u8;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1>() - 64usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1>() - 4usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::display_cycles"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        display_cycles
    )
        - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::display_state"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        display_state
    )
        - 4usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::div_cycles"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        div_cycles
    ) - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::div_state"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        div_state
    ) - 12usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::div_counter"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        div_counter
    )
        - 16usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::tima_reload_state"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        tima_reload_state
    )
        - 18usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::serial_master_clock"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        serial_master_clock
    )
        - 19usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::serial_mask"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        serial_mask
    )
        - 20usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::double_speed_alignment"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
            double_speed_alignment
        ) - 21usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::serial_count"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        serial_count
    )
        - 22usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::speed_switch_halt_countdown",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        speed_switch_halt_countdown
    ) - 24usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::speed_switch_countdown"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
            speed_switch_countdown
        ) - 28usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::speed_switch_freeze"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        speed_switch_freeze
    )
        - 29usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::cycles_since_vblank_callback",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        cycles_since_vblank_callback
    ) - 32usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::lcd_disabled_outside_of_vblank",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        lcd_disabled_outside_of_vblank
    ) - 36usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::allowed_pending_cycles"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
            allowed_pending_cycles
        ) - 40usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::mode3_batching_length"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        mode3_batching_length
    )
        - 44usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::joyp_switching_delay"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        joyp_switching_delay
    )
        - 46usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::joyp_switch_value"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        joyp_switch_value
    )
        - 47usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1::key_bounce_timing"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6__bindgen_ty_1,
        key_bounce_timing
    )
        - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_6"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_6>() - 64usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_6"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_6>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_6::timing_section_start"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_6,
        timing_section_start
    ) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_7 {
    pub apu_section_start: u8,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_7__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_7__bindgen_ty_1 {
    pub apu: GB_apu_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_7__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_7__bindgen_ty_1>() - 98usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_7__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_7__bindgen_ty_1>() - 2usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_7__bindgen_ty_1::apu"]
        [::core::mem::offset_of!(GB_gameboy_internal_s__bindgen_ty_7__bindgen_ty_1, apu) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_7"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_7>() - 104usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_7"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_7>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_7::apu_section_start"]
        [::core::mem::offset_of!(GB_gameboy_internal_s__bindgen_ty_7, apu_section_start) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_8 {
    pub rtc_section_start: u8,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1 {
    pub rtc_real: GB_rtc_time_t,
    pub rtc_latched: GB_rtc_time_t,
    pub last_rtc_second: u64,
    pub rtc_cycles: u32,
    pub tpp1_mr4: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1>() - 32usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1::rtc_real"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1,
        rtc_real
    ) - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1::rtc_latched"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1,
        rtc_latched
    ) - 5usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1::last_rtc_second"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1,
        last_rtc_second
    )
        - 16usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1::rtc_cycles"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1,
        rtc_cycles
    ) - 24usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1::tpp1_mr4"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_8__bindgen_ty_1,
        tpp1_mr4
    ) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_8"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_8>() - 32usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_8"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_8>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_8::rtc_section_start"]
        [::core::mem::offset_of!(GB_gameboy_internal_s__bindgen_ty_8, rtc_section_start) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_9 {
    pub video_section_start: u8,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1 {
    pub vram_size: u32,
    pub cgb_vram_bank: bool,
    pub oam: [u8; 160usize],
    pub background_palettes_data: [u8; 64usize],
    pub object_palettes_data: [u8; 64usize],
    pub position_in_line: u8,
    pub stat_interrupt_line: bool,
    pub window_y: u8,
    pub frame_skip_state: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_1,
    pub oam_read_blocked: bool,
    pub vram_read_blocked: bool,
    pub oam_write_blocked: bool,
    pub vram_write_blocked: bool,
    pub current_line: u8,
    pub ly_for_comparison: u16,
    pub bg_fifo: GB_fifo_t,
    pub oam_fifo: GB_fifo_t,
    pub fetcher_y: u8,
    pub cycles_for_line: u16,
    pub current_tile: u8,
    pub current_tile_attributes: u8,
    pub current_tile_data: [u8; 2usize],
    pub fetcher_state: u8,
    pub window_is_being_fetched: bool,
    pub wx166_glitch__do_not_use: bool,
    pub wx_triggered: bool,
    pub visible_objs: [u8; 10usize],
    pub objects_x: [u8; 10usize],
    pub objects_y: [u8; 10usize],
    pub object_tile_data: [u8; 2usize],
    pub mode2_y_bus: u8,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_2,
    pub n_visible_objs: u8,
    pub orig_n_visible_objs: u8,
    pub oam_search_index: u8,
    pub accessed_oam_row: u8,
    pub mode_for_interrupt: u8,
    pub lyc_interrupt_line: bool,
    pub cgb_palettes_blocked: bool,
    pub current_lcd_line: u8,
    pub object_priority: u8,
    pub oam_ppu_blocked: bool,
    pub vram_ppu_blocked: bool,
    pub cgb_palettes_ppu_blocked: bool,
    pub object_fetch_aborted: bool,
    pub during_object_fetch: bool,
    pub object_low_line_address: u16,
    pub wy_triggered: bool,
    pub window_tile_x: u8,
    pub lcd_x: u8,
    pub is_odd_frame: bool,
    pub last_tile_data_address: u16,
    pub last_tile_index_address: u16,
    pub data_for_sel_glitch: u8,
    pub delayed_glitch_hblank_interrupt: bool,
    pub frame_repeat_countdown: u32,
    pub disable_window_pixel_insertion_glitch: bool,
    pub insert_bg_pixel: bool,
    pub cpu_vram_bus: u8,
    pub frame_parity_ticks: u32,
    pub last_tileset: bool,
    pub cgb_wx_glitch: bool,
    pub line_has_fractional_scrolling: bool,
    pub wy_check_modulo: u8,
    pub wy_check_scheduled: bool,
    pub wy_just_checked: bool,
    pub wx_166_interrupt_glitch: bool,
}
pub const GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1_GB_FRAMESKIP_LCD_TURNED_ON:
    GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_1 = 0;
pub const GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1_GB_FRAMESKIP_FIRST_FRAME_RENDERED:
    GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_1 = 1;
pub type GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_1 = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_2 {
    pub mode2_x_bus: u8,
    pub object_flags: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_2"][::core::mem::size_of::<
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_2,
    >() - 1usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_2>(
        ) - 1usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_2::mode2_x_bus",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_2,
        mode2_x_bus
    ) - 0usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_2::object_flags",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1__bindgen_ty_2,
        object_flags
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1>() - 464usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1>() - 4usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::vram_size"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        vram_size
    ) - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::cgb_vram_bank"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        cgb_vram_bank
    )
        - 4usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::oam"]
        [::core::mem::offset_of!(GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1, oam) - 5usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::background_palettes_data",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        background_palettes_data
    ) - 165usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::object_palettes_data"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        object_palettes_data
    )
        - 229usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::position_in_line"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        position_in_line
    )
        - 293usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::stat_interrupt_line"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        stat_interrupt_line
    )
        - 294usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::window_y"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        window_y
    ) - 295usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::frame_skip_state"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        frame_skip_state
    )
        - 296usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::oam_read_blocked"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        oam_read_blocked
    )
        - 297usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::vram_read_blocked"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        vram_read_blocked
    )
        - 298usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::oam_write_blocked"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        oam_write_blocked
    )
        - 299usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::vram_write_blocked"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        vram_write_blocked
    )
        - 300usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::current_line"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        current_line
    )
        - 301usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::ly_for_comparison"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        ly_for_comparison
    )
        - 302usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::bg_fifo"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        bg_fifo
    ) - 304usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::oam_fifo"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        oam_fifo
    ) - 338usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::fetcher_y"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        fetcher_y
    ) - 372usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::cycles_for_line"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        cycles_for_line
    )
        - 374usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::current_tile"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        current_tile
    )
        - 376usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::current_tile_attributes"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
            current_tile_attributes
        ) - 377usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::current_tile_data"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        current_tile_data
    )
        - 378usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::fetcher_state"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        fetcher_state
    )
        - 380usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::window_is_being_fetched"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
            window_is_being_fetched
        ) - 381usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::wx166_glitch__do_not_use",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        wx166_glitch__do_not_use
    ) - 382usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::wx_triggered"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        wx_triggered
    )
        - 383usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::visible_objs"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        visible_objs
    )
        - 384usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::objects_x"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        objects_x
    ) - 394usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::objects_y"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        objects_y
    ) - 404usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::object_tile_data"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        object_tile_data
    )
        - 414usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::mode2_y_bus"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        mode2_y_bus
    )
        - 416usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::n_visible_objs"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        n_visible_objs
    )
        - 418usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::orig_n_visible_objs"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        orig_n_visible_objs
    )
        - 419usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::oam_search_index"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        oam_search_index
    )
        - 420usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::accessed_oam_row"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        accessed_oam_row
    )
        - 421usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::mode_for_interrupt"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        mode_for_interrupt
    )
        - 422usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::lyc_interrupt_line"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        lyc_interrupt_line
    )
        - 423usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::cgb_palettes_blocked"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        cgb_palettes_blocked
    )
        - 424usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::current_lcd_line"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        current_lcd_line
    )
        - 425usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::object_priority"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        object_priority
    )
        - 426usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::oam_ppu_blocked"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        oam_ppu_blocked
    )
        - 427usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::vram_ppu_blocked"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        vram_ppu_blocked
    )
        - 428usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::cgb_palettes_ppu_blocked",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        cgb_palettes_ppu_blocked
    ) - 429usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::object_fetch_aborted"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        object_fetch_aborted
    )
        - 430usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::during_object_fetch"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        during_object_fetch
    )
        - 431usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::object_low_line_address"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
            object_low_line_address
        ) - 432usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::wy_triggered"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        wy_triggered
    )
        - 434usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::window_tile_x"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        window_tile_x
    )
        - 435usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::lcd_x"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        lcd_x
    ) - 436usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::is_odd_frame"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        is_odd_frame
    )
        - 437usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::last_tile_data_address"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
            last_tile_data_address
        ) - 438usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::last_tile_index_address"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
            last_tile_index_address
        ) - 440usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::data_for_sel_glitch"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        data_for_sel_glitch
    )
        - 442usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::delayed_glitch_hblank_interrupt",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        delayed_glitch_hblank_interrupt
    ) - 443usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::frame_repeat_countdown"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
            frame_repeat_countdown
        ) - 444usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::disable_window_pixel_insertion_glitch",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        disable_window_pixel_insertion_glitch
    ) - 448usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::insert_bg_pixel"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        insert_bg_pixel
    )
        - 449usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::cpu_vram_bus"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        cpu_vram_bus
    )
        - 450usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::frame_parity_ticks"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        frame_parity_ticks
    )
        - 452usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::last_tileset"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        last_tileset
    )
        - 456usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::cgb_wx_glitch"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        cgb_wx_glitch
    )
        - 457usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::line_has_fractional_scrolling",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        line_has_fractional_scrolling
    ) - 458usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::wy_check_modulo"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        wy_check_modulo
    )
        - 459usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::wy_check_scheduled"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        wy_check_scheduled
    )
        - 460usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::wy_just_checked"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
        wy_just_checked
    )
        - 461usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1::wx_166_interrupt_glitch"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_9__bindgen_ty_1,
            wx_166_interrupt_glitch
        ) - 462usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_9"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_9>() - 464usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_9"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_9>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_9::video_section_start"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_9,
        video_section_start
    ) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_10 {
    pub accessory_section_start: u8,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1 {
    pub accessory: GB_accessory_t,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1__bindgen_ty_1 {
    pub printer: GB_printer_t,
    pub workboy: GB_workboy_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1__bindgen_ty_1>(
        ) - 32672usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1__bindgen_ty_1>(
        ) - 4usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1__bindgen_ty_1::printer"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1__bindgen_ty_1,
            printer
        ) - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1__bindgen_ty_1::workboy"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1__bindgen_ty_1,
            workboy
        ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1>() - 32676usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1>() - 4usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1::accessory"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_10__bindgen_ty_1,
        accessory
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_10"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_10>() - 32680usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_10"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_10>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_10::accessory_section_start"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_10,
        accessory_section_start
    ) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union GB_gameboy_internal_s__bindgen_ty_11 {
    pub unsaved_section_start: u8,
    pub __bindgen_anon_1: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1 {
    pub rom: *mut u8,
    pub rom_size: u32,
    pub cartridge_type: *const GB_cartridge_t,
    pub mbc1_wiring: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_1,
    pub is_mbc30: bool,
    pub pending_cycles: ::core::ffi::c_uint,
    pub ram: *mut u8,
    pub vram: *mut u8,
    pub mbc_ram: *mut u8,
    pub screen: *mut u32,
    pub background_palettes_rgb: [u32; 32usize],
    pub object_palettes_rgb: [u32; 32usize],
    pub dmg_palette: *const GB_palette_t,
    pub color_correction_mode: GB_color_correction_mode_t,
    pub light_temperature: f64,
    pub keys: [[bool; 8usize]; 4usize],
    pub use_faux_analog: [bool; 4usize],
    pub faux_analog_inputs:
        [GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_2; 4usize],
    pub faux_analog_ticks: u8,
    pub accelerometer_x: f64,
    pub accelerometer_y: f64,
    pub border_mode: GB_border_mode_t,
    pub borrowed_border: GB_sgb_border_t,
    pub tried_loading_sgb_border: bool,
    pub has_sgb_border: bool,
    pub objects_disabled: bool,
    pub background_disabled: bool,
    pub joyp_accessed: bool,
    pub illegal_inputs_allowed: bool,
    pub no_bouncing_emulation: bool,
    pub joypad_is_stable: bool,
    pub last_sync: u64,
    pub last_render: u64,
    pub cycles_since_last_sync: u64,
    pub rtc_mode: GB_rtc_mode_t,
    pub rtc_second_length: u32,
    pub clock_rate: u32,
    pub unmultiplied_clock_rate: u32,
    pub data_bus_decay: u32,
    pub apu_output: GB_apu_output_t,
    pub user_data: *mut ::core::ffi::c_void,
    pub log_callback: GB_log_callback_t,
    pub input_callback: GB_input_callback_t,
    pub async_input_callback: GB_input_callback_t,
    pub rgb_encode_callback: GB_rgb_encode_callback_t,
    pub vblank_callback: GB_vblank_callback_t,
    pub infrared_callback: GB_infrared_callback_t,
    pub camera_get_pixel_callback: GB_camera_get_pixel_callback_t,
    pub camera_update_request_callback: GB_camera_update_request_callback_t,
    pub rumble_callback: GB_rumble_callback_t,
    pub serial_transfer_bit_start_callback: GB_serial_transfer_bit_start_callback_t,
    pub serial_transfer_bit_end_callback: GB_serial_transfer_bit_end_callback_t,
    pub update_input_hint_callback: GB_update_input_hint_callback_t,
    pub joyp_write_callback: GB_joyp_write_callback_t,
    pub icd_pixel_callback: GB_icd_pixel_callback_t,
    pub icd_hreset_callback: GB_icd_vreset_callback_t,
    pub icd_vreset_callback: GB_icd_vreset_callback_t,
    pub read_memory_callback: GB_read_memory_callback_t,
    pub write_memory_callback: GB_write_memory_callback_t,
    pub boot_rom_load_callback: GB_boot_rom_load_callback_t,
    pub printer_callback: GB_print_image_callback_t,
    pub printer_done_callback: GB_printer_done_callback_t,
    pub workboy_set_time_callback: GB_workboy_set_time_callback_t,
    pub workboy_get_time_callback: GB_workboy_get_time_callback_t,
    pub execution_callback: GB_execution_callback_t,
    pub lcd_line_callback: GB_lcd_line_callback_t,
    pub lcd_status_callback: GB_lcd_status_callback_t,
    pub debug_stopped: bool,
    pub debug_disable: bool,
    pub debug_fin_command: bool,
    pub debug_next_command: bool,
    pub debug_active: bool,
    pub help_shown: bool,
    pub backstep_instructions: u32,
    pub n_breakpoints: u16,
    pub breakpoints: *mut GB_breakpoint_s,
    pub has_jump_to_breakpoints: bool,
    pub has_software_breakpoints: bool,
    pub nontrivial_jump_state: *mut ::core::ffi::c_void,
    pub non_trivial_jump_breakpoint_occured: bool,
    pub debug_call_depth: ::core::ffi::c_int,
    pub sp_for_call_depth: [u16; 512usize],
    pub addr_for_call_depth: [u16; 512usize],
    pub backtrace_size: ::core::ffi::c_uint,
    pub backtrace_sps: [u16; 512usize],
    pub backtrace_returns:
        [GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_3; 512usize],
    pub n_watchpoints: u16,
    pub watchpoints: *mut GB_watchpoint_s,
    pub bank_symbols: *mut *mut GB_symbol_map_t,
    pub n_symbol_maps: usize,
    pub reversed_symbol_map: GB_reversed_symbol_map_t,
    pub debugger_ticks: u64,
    pub absolute_debugger_ticks: u64,
    pub undo_state: *mut u8,
    pub undo_label: *const ::core::ffi::c_char,
    pub debugger_reload_callback: GB_debugger_reload_callback_t,
    pub current_frame_idle_cycles: u32,
    pub current_frame_busy_cycles: u32,
    pub last_frame_idle_cycles: u32,
    pub last_frame_busy_cycles: u32,
    pub current_second_idle_cycles: u32,
    pub current_second_busy_cycles: u32,
    pub last_second_idle_cycles: u32,
    pub last_second_busy_cycles: u32,
    pub usage_frame_count: u8,
    pub rewind_buffer_length: usize,
    pub rewind_state_size: usize,
    pub rewind_sequences: *mut GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4,
    pub rewind_pos: usize,
    pub rewind_disable_invalidation: bool,
    pub sgb: *mut GB_sgb_t,
    pub sgb_intro_jingle_phases: [f64; 7usize],
    pub sgb_intro_sweep_phase: f64,
    pub sgb_intro_sweep_previous_sample: f64,
    pub cheat_enabled: bool,
    pub cheat_count: usize,
    pub cheats: *mut *mut GB_cheat_t,
    pub cheat_hash: [*mut GB_cheat_hash_t; 256usize],
    pub cheat_search_data: *mut u8,
    pub cheat_search_bitmap: *mut u8,
    pub cheat_search_count: usize,
    pub cheat_search_data_type: GB_cheat_search_data_type_t,
    pub turbo: bool,
    pub turbo_dont_skip: bool,
    pub turbo_cap_multiplier: f64,
    pub enable_skipped_frame_vblank_callbacks: bool,
    pub disable_rendering: bool,
    pub boot_rom: [u8; 2304usize],
    pub vblank_just_occured: bool,
    pub cycles_since_run: ::core::ffi::c_uint,
    pub clock_multiplier: f64,
    pub rumble_mode: GB_rumble_mode_t,
    pub rumble_on_cycles: u32,
    pub rumble_off_cycles: u32,
    pub wx_just_changed: bool,
    pub tile_sel_glitch: bool,
    pub disable_oam_corruption: bool,
    pub in_dma_read: bool,
    pub hdma_in_progress: bool,
    pub returned_open_bus: bool,
    pub addr_for_hdma_conflict: u16,
    pub during_div_write: bool,
    pub running_thread_id: *mut ::core::ffi::c_void,
    pub gbs_header: GB_gbs_header_t,
}
pub const GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1_GB_STANDARD_MBC1_WIRING:
    GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_1 = 0;
pub const GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1_GB_MBC1M_WIRING:
    GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_1 = 1;
pub type GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_1 = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_2 {
    pub x: i8,
    pub y: i8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_2>(
        ) - 2usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_2>(
        ) - 1usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_2::x"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_2,
        x
    )
        - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_2::y"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_2,
        y
    )
        - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_3 {
    pub bank: u16,
    pub addr: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_3>(
        ) - 4usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_3>(
        ) - 2usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_3::bank"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_3,
        bank
    )
        - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_3::addr"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_3,
        addr
    )
        - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4 {
    pub key_state: *mut u8,
    pub compressed_states: [*mut u8; 255usize],
    pub instruction_count: [u32; 256usize],
    pub pos: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4>(
        ) - 3080usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4>(
        ) - 8usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4::key_state",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4,
        key_state
    ) - 0usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4::compressed_states",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4,
        compressed_states
    ) - 8usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4::instruction_count",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4,
        instruction_count
    ) - 2048usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4::pos"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1__bindgen_ty_4,
        pos
    )
        - 3072usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1>() - 91168usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rom"]
        [::core::mem::offset_of!(GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1, rom) - 0usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rom_size"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rom_size
    ) - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::cartridge_type"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        cartridge_type
    )
        - 16usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::mbc1_wiring"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        mbc1_wiring
    )
        - 24usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::is_mbc30"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        is_mbc30
    ) - 28usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::pending_cycles"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        pending_cycles
    )
        - 32usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::ram"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        ram
    ) - 40usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::vram"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        vram
    ) - 48usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::mbc_ram"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        mbc_ram
    ) - 56usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::screen"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        screen
    ) - 64usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::background_palettes_rgb",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        background_palettes_rgb
    ) - 72usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::object_palettes_rgb"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        object_palettes_rgb
    )
        - 200usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::dmg_palette"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        dmg_palette
    )
        - 328usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::color_correction_mode"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            color_correction_mode
        ) - 336usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::light_temperature"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        light_temperature
    )
        - 344usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::keys"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        keys
    ) - 352usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::use_faux_analog"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        use_faux_analog
    )
        - 384usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::faux_analog_inputs"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        faux_analog_inputs
    )
        - 388usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::faux_analog_ticks"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        faux_analog_ticks
    )
        - 396usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::accelerometer_x"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        accelerometer_x
    )
        - 400usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::accelerometer_y"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        accelerometer_y
    )
        - 408usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::border_mode"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        border_mode
    )
        - 416usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::borrowed_border"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        borrowed_border
    )
        - 420usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::tried_loading_sgb_border",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        tried_loading_sgb_border
    ) - 10788usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::has_sgb_border"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        has_sgb_border
    )
        - 10789usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::objects_disabled"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        objects_disabled
    )
        - 10790usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::background_disabled"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        background_disabled
    )
        - 10791usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::joyp_accessed"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        joyp_accessed
    )
        - 10792usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::illegal_inputs_allowed"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            illegal_inputs_allowed
        ) - 10793usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::no_bouncing_emulation"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            no_bouncing_emulation
        ) - 10794usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::joypad_is_stable"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        joypad_is_stable
    )
        - 10795usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::last_sync"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        last_sync
    )
        - 10800usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::last_render"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        last_render
    )
        - 10808usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::cycles_since_last_sync"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            cycles_since_last_sync
        ) - 10816usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rtc_mode"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rtc_mode
    )
        - 10824usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rtc_second_length"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rtc_second_length
    )
        - 10828usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::clock_rate"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        clock_rate
    )
        - 10832usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::unmultiplied_clock_rate",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        unmultiplied_clock_rate
    ) - 10836usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::data_bus_decay"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        data_bus_decay
    )
        - 10840usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::apu_output"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        apu_output
    )
        - 10848usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::user_data"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        user_data
    )
        - 15440usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::log_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        log_callback
    )
        - 15448usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::input_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        input_callback
    )
        - 15456usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::async_input_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        async_input_callback
    )
        - 15464usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rgb_encode_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rgb_encode_callback
    )
        - 15472usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::vblank_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        vblank_callback
    )
        - 15480usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::infrared_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        infrared_callback
    )
        - 15488usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::camera_get_pixel_callback",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        camera_get_pixel_callback
    ) - 15496usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::camera_update_request_callback",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        camera_update_request_callback
    ) - 15504usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rumble_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rumble_callback
    )
        - 15512usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::serial_transfer_bit_start_callback",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        serial_transfer_bit_start_callback
    ) - 15520usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::serial_transfer_bit_end_callback",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        serial_transfer_bit_end_callback
    ) - 15528usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::update_input_hint_callback",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        update_input_hint_callback
    ) - 15536usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::joyp_write_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        joyp_write_callback
    )
        - 15544usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::icd_pixel_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        icd_pixel_callback
    )
        - 15552usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::icd_hreset_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        icd_hreset_callback
    )
        - 15560usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::icd_vreset_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        icd_vreset_callback
    )
        - 15568usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::read_memory_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        read_memory_callback
    )
        - 15576usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::write_memory_callback"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            write_memory_callback
        ) - 15584usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::boot_rom_load_callback"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            boot_rom_load_callback
        ) - 15592usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::printer_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        printer_callback
    )
        - 15600usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::printer_done_callback"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            printer_done_callback
        ) - 15608usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::workboy_set_time_callback",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        workboy_set_time_callback
    ) - 15616usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::workboy_get_time_callback",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        workboy_get_time_callback
    ) - 15624usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::execution_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        execution_callback
    )
        - 15632usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::lcd_line_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        lcd_line_callback
    )
        - 15640usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::lcd_status_callback"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        lcd_status_callback
    )
        - 15648usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::debug_stopped"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        debug_stopped
    )
        - 15656usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::debug_disable"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        debug_disable
    )
        - 15657usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::debug_fin_command"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        debug_fin_command
    )
        - 15658usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::debug_next_command"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        debug_next_command
    )
        - 15659usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::debug_active"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        debug_active
    )
        - 15660usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::help_shown"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        help_shown
    )
        - 15661usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::backstep_instructions"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            backstep_instructions
        ) - 15664usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::n_breakpoints"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        n_breakpoints
    )
        - 15668usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::breakpoints"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        breakpoints
    )
        - 15672usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::has_jump_to_breakpoints",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        has_jump_to_breakpoints
    ) - 15680usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::has_software_breakpoints",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        has_software_breakpoints
    ) - 15681usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::nontrivial_jump_state"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            nontrivial_jump_state
        ) - 15688usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::non_trivial_jump_breakpoint_occured",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        non_trivial_jump_breakpoint_occured
    ) - 15696usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::debug_call_depth"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        debug_call_depth
    )
        - 15700usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::sp_for_call_depth"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        sp_for_call_depth
    )
        - 15704usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::addr_for_call_depth"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        addr_for_call_depth
    )
        - 16728usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::backtrace_size"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        backtrace_size
    )
        - 17752usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::backtrace_sps"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        backtrace_sps
    )
        - 17756usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::backtrace_returns"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        backtrace_returns
    )
        - 18780usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::n_watchpoints"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        n_watchpoints
    )
        - 20828usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::watchpoints"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        watchpoints
    )
        - 20832usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::bank_symbols"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        bank_symbols
    )
        - 20840usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::n_symbol_maps"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        n_symbol_maps
    )
        - 20848usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::reversed_symbol_map"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        reversed_symbol_map
    )
        - 20856usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::debugger_ticks"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        debugger_ticks
    )
        - 86392usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::absolute_debugger_ticks",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        absolute_debugger_ticks
    ) - 86400usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::undo_state"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        undo_state
    )
        - 86408usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::undo_label"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        undo_label
    )
        - 86416usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::debugger_reload_callback",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        debugger_reload_callback
    ) - 86424usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::current_frame_idle_cycles",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        current_frame_idle_cycles
    ) - 86432usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::current_frame_busy_cycles",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        current_frame_busy_cycles
    ) - 86436usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::last_frame_idle_cycles"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            last_frame_idle_cycles
        ) - 86440usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::last_frame_busy_cycles"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            last_frame_busy_cycles
        ) - 86444usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::current_second_idle_cycles",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        current_second_idle_cycles
    ) - 86448usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::current_second_busy_cycles",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        current_second_busy_cycles
    ) - 86452usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::last_second_idle_cycles",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        last_second_idle_cycles
    ) - 86456usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::last_second_busy_cycles",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        last_second_busy_cycles
    ) - 86460usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::usage_frame_count"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        usage_frame_count
    )
        - 86464usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rewind_buffer_length"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rewind_buffer_length
    )
        - 86472usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rewind_state_size"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rewind_state_size
    )
        - 86480usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rewind_sequences"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rewind_sequences
    )
        - 86488usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rewind_pos"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rewind_pos
    )
        - 86496usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rewind_disable_invalidation",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rewind_disable_invalidation
    ) - 86504usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::sgb"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        sgb
    ) - 86512usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::sgb_intro_jingle_phases",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        sgb_intro_jingle_phases
    ) - 86520usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::sgb_intro_sweep_phase"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            sgb_intro_sweep_phase
        ) - 86576usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::sgb_intro_sweep_previous_sample",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        sgb_intro_sweep_previous_sample
    ) - 86584usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::cheat_enabled"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        cheat_enabled
    )
        - 86592usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::cheat_count"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        cheat_count
    )
        - 86600usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::cheats"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        cheats
    ) - 86608usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::cheat_hash"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        cheat_hash
    )
        - 86616usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::cheat_search_data"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        cheat_search_data
    )
        - 88664usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::cheat_search_bitmap"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        cheat_search_bitmap
    )
        - 88672usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::cheat_search_count"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        cheat_search_count
    )
        - 88680usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::cheat_search_data_type"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            cheat_search_data_type
        ) - 88688usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::turbo"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        turbo
    ) - 88692usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::turbo_dont_skip"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        turbo_dont_skip
    )
        - 88693usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::turbo_cap_multiplier"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        turbo_cap_multiplier
    )
        - 88696usize];
    [
        "Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::enable_skipped_frame_vblank_callbacks",
    ][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        enable_skipped_frame_vblank_callbacks
    ) - 88704usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::disable_rendering"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        disable_rendering
    )
        - 88705usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::boot_rom"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        boot_rom
    )
        - 88706usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::vblank_just_occured"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        vblank_just_occured
    )
        - 91010usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::cycles_since_run"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        cycles_since_run
    )
        - 91012usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::clock_multiplier"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        clock_multiplier
    )
        - 91016usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rumble_mode"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rumble_mode
    )
        - 91024usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rumble_on_cycles"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rumble_on_cycles
    )
        - 91028usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::rumble_off_cycles"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        rumble_off_cycles
    )
        - 91032usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::wx_just_changed"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        wx_just_changed
    )
        - 91036usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::tile_sel_glitch"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        tile_sel_glitch
    )
        - 91037usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::disable_oam_corruption"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            disable_oam_corruption
        ) - 91038usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::in_dma_read"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        in_dma_read
    )
        - 91039usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::hdma_in_progress"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        hdma_in_progress
    )
        - 91040usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::returned_open_bus"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        returned_open_bus
    )
        - 91041usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::addr_for_hdma_conflict"]
        [::core::mem::offset_of!(
            GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
            addr_for_hdma_conflict
        ) - 91042usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::during_div_write"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        during_div_write
    )
        - 91044usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::running_thread_id"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        running_thread_id
    )
        - 91048usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1::gbs_header"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11__bindgen_ty_1,
        gbs_header
    )
        - 91056usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s__bindgen_ty_11"]
        [::core::mem::size_of::<GB_gameboy_internal_s__bindgen_ty_11>() - 91168usize];
    ["Alignment of GB_gameboy_internal_s__bindgen_ty_11"]
        [::core::mem::align_of::<GB_gameboy_internal_s__bindgen_ty_11>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s__bindgen_ty_11::unsaved_section_start"][::core::mem::offset_of!(
        GB_gameboy_internal_s__bindgen_ty_11,
        unsaved_section_start
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_internal_s"]
        [::core::mem::size_of::<GB_gameboy_internal_s>() - 125048usize];
    ["Alignment of GB_gameboy_internal_s"]
        [::core::mem::align_of::<GB_gameboy_internal_s>() - 8usize];
    ["Offset of field: GB_gameboy_internal_s::header_section_end"]
        [::core::mem::offset_of!(GB_gameboy_internal_s, header_section_end) - 8usize];
    ["Offset of field: GB_gameboy_internal_s::core_state_section_end"]
        [::core::mem::offset_of!(GB_gameboy_internal_s, core_state_section_end) - 160usize];
    ["Offset of field: GB_gameboy_internal_s::dma_section_end"]
        [::core::mem::offset_of!(GB_gameboy_internal_s, dma_section_end) - 184usize];
    ["Offset of field: GB_gameboy_internal_s::mbc_section_end"]
        [::core::mem::offset_of!(GB_gameboy_internal_s, mbc_section_end) - 280usize];
    ["Offset of field: GB_gameboy_internal_s::hram_section_end"]
        [::core::mem::offset_of!(GB_gameboy_internal_s, hram_section_end) - 536usize];
    ["Offset of field: GB_gameboy_internal_s::timing_section_end"]
        [::core::mem::offset_of!(GB_gameboy_internal_s, timing_section_end) - 600usize];
    ["Offset of field: GB_gameboy_internal_s::apu_section_end"]
        [::core::mem::offset_of!(GB_gameboy_internal_s, apu_section_end) - 704usize];
    ["Offset of field: GB_gameboy_internal_s::rtc_section_end"]
        [::core::mem::offset_of!(GB_gameboy_internal_s, rtc_section_end) - 736usize];
    ["Offset of field: GB_gameboy_internal_s::video_section_end"]
        [::core::mem::offset_of!(GB_gameboy_internal_s, video_section_end) - 1200usize];
    ["Offset of field: GB_gameboy_internal_s::accessory_section_end"]
        [::core::mem::offset_of!(GB_gameboy_internal_s, accessory_section_end) - 33880usize];
    ["Offset of field: GB_gameboy_internal_s::unsaved_section_end"]
        [::core::mem::offset_of!(GB_gameboy_internal_s, unsaved_section_end) - 125048usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct GB_gameboy_s {
    pub __internal: [u8; 125048usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GB_gameboy_s"][::core::mem::size_of::<GB_gameboy_s>() - 125048usize];
    ["Alignment of GB_gameboy_s"][::core::mem::align_of::<GB_gameboy_s>() - 8usize];
    ["Offset of field: GB_gameboy_s::__internal"]
        [::core::mem::offset_of!(GB_gameboy_s, __internal) - 0usize];
};
unsafe extern "C" {
    pub fn GB_init(gb: *mut GB_gameboy_t, model: GB_model_t) -> *mut GB_gameboy_t;
}
unsafe extern "C" {
    pub fn GB_free(gb: *mut GB_gameboy_t);
}
unsafe extern "C" {
    pub fn GB_alloc() -> *mut GB_gameboy_t;
}
unsafe extern "C" {
    pub fn GB_dealloc(gb: *mut GB_gameboy_t);
}
unsafe extern "C" {
    pub fn GB_allocation_size() -> usize;
}
unsafe extern "C" {
    pub fn GB_is_inited(gb: *mut GB_gameboy_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_is_cgb(gb: *const GB_gameboy_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_is_cgb_in_cgb_mode(gb: *mut GB_gameboy_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_is_sgb(gb: *mut GB_gameboy_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_is_hle_sgb(gb: *mut GB_gameboy_t) -> bool;
}
unsafe extern "C" {
    pub fn GB_get_model(gb: *mut GB_gameboy_t) -> GB_model_t;
}
unsafe extern "C" {
